[
{"title": "Diabetes", "tags": ["Symptoms"], "Type1": true, "Type2": true, "numberOfReplies": 4, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Here recently I've had an increase of urination...Especially at night. I seem to be thirsty more and have dry mouth especially at night and when I wake up. I'm tired more often even though I get 8 plus hours of sleep at night. Also, I'm hungry all the time and sometimes not long after I eat.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Foot Ulcer", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I have had a foot ulcer for about 3 months now. The foot doctor keeps cutting it away but it doesn't seem to be healing. Any suggestions?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Dizziness", "tags": ["Insulin", "Treatments", "Living With", "Type 2 Diabetes", "Symptoms"], "Type1": false, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I`m 72 years Bypass Surgery in 2004, Later bout of Pulmonary edema, used to walk daily about 5-6 Kilo Meters, but now feeling weakness and Dizziness after Pulmonary Edema a year ago, I can not venture out alone ?Can this situation be remedied?Thanks<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "i have low back pains so i have reduced my excerising   i have noticed that i am really have circulations problems   is there anything else i can do or take to help", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    i have low back pains so i have reduced my excerising scared of surgery i have noticed that i am really haveing circulations problems is there anything else i can do or take to help<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Insulin", "tags": ["Insulin"], "Type1": true, "Type2": true, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I take insulin twice a day<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "my type 1 wife keeps nodding off", "tags": ["Type 1 Diabetes", "Symptoms"], "Type1": true, "Type2": false, "numberOfReplies": 5, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    hey guys,so my wife was diagnosed with type 1 about 6 years ago (due to cancer radiation damaged her pancreas).the problem is that during all hours, she nods off quite frequently. what’s confusing is that she will nod off even if her blood sugar is normal. she gets pretty annoyed when I point this out or try to help. what does this mean? is it dangerous? I’m starting to get worried as this is a daily occurance. what should I do? help..!<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Medication", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 3, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I take 1000 mg of metformin twice daily. Been told 2 different things but 2 different dr. One says take 1000 mg at time and one says only take 500mg at time as body only absorbs that much and other 500 is going to waste.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Blood Sugar Crash Hangover", "tags": ["Treatments", "Type 1 Diabetes", "Symptoms"], "Type1": true, "Type2": false, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Mosts posts and doctors always talk about what to due in a low blood sugar situation. As a type 1 diabetic I know what to eat and take to raise my blood sugar. My issue is what to do after the low blood sugar crash and I have elevated it. Does anyone have any remedies for the next day after you had a low blood sugar crash at night? On nights I go to the gym my blood sugar sometimes crashes. I wake up and eat but then the next day Iam left with a hangover feeling, cloudy brain and almost toxic. As if I was out drinking all night and got no sleep. As a working individual I do not have the option of calling in sick and staying in bedI have not once seen an article talking about the after effects of low blood sugar and how to treat that. I know I cant be the only diabetic that goes through this.Any suggestions?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Help needed, father continuous painful hiccups for over a year", "tags": ["Insulin", "Treatments", "Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 6, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    ********** CURRENT PROBLEM **********Hi,Thank you very much for your time and attention.It is a long description but I think it was important to include. I have tried to make it as readable as possible. My father who is 70 years old has been experiencing continuous hiccups for a year now. This is obviously very painful as he is unable to eat or even sleep properly.After testing countless home remedies, we got him checked by medical experts about 6 months ago. Almost all of them informed us it is due to prolonged stress, which might be true due to certain events in our lives.********** BACKGROUND INFO **********Age = 70 years.Ethnicity = South Asian.He has had high blood pressure and high cholesterol for more than 25 years, has been gout patient too for that amount of time.He has been obese as well for 25+ years, current weight = 245 lb, height = almost 6 feet.He also had type 2 diabetes probably for 15+ years.He can barely walk and is not active at all, mostly due to back and joint pains.He has avoided almost all meat products for 10+ years, but I think he gained weight due to more consumption of carbohydrates, specifically white flour and rice.No smoking/drinking or recreational drugs habits thankfully.He has also been experiencing cough and weakness and loss of appetite for the last 20 days or so.None of the doctors were 100% sure about the solution and prescribed the following tests and medications: ********** TESTS DONE **********All information is within 3 months range.-Uric Acid = 7 [normal]-All Cholesterols Total/HDL/LDL within range-Triglycerides 10-20% above normal range-ALT normal-Blood sugar controlled by 2 medicines, Glucophage and Glucobay-His ultrasound was i think normal too.-In a very recent test, it was shown his heart walls have become thick due to prolonged stress and cholesterol. ********** DOCTORS CURRENT CONSENSUS **********Out of the 5 doctors consulted, 2 are Cardiologists, 2 General Practitioner and a very recent one is Neurologist. Should I also consult Gastroenterologist?-Doctors ruled out existence of tumors or cancers etc based on ultrasound and long history of hiccups.Few doctors also suggested it might be GERD or acid reflux but he does not have all the symptoms.********** ANY OTHER TESTS NEEDED? **********I wonder now why no doctor asked to check his \"cortisol\" range? Is it not important to test to measure stress?Any other important factors to test for his stress levels?Is ENDOSCOPY really needed? No doctor so far suggested it but after researching online it seems very important?**********RECENT MEDICATIONS FOR HICCUPS**********Medications for hiccups he has been using regularly since the past 3-4 months-Motilium tablet [4 months][1+1+1 before each meal]-Nexum capsule [3 months][1+0+1 before each meal]-Gaviscon syrup [3 months] [1+0+1, 1 tbsp after each meal] -Motival tablet [1 month][1, in the night] for stress/anxiety-RIVOTRIL for stress management prescribed by a neurologist for 3 weeks.******OTHER DAILY LONGTERM MEDICATIONS HE TAKES REGULARLY*******These are additional medications he has to take daily for heart, blood pressure, sugar, uric acid and pain killers etc.-COEZIDAY 100mg 1x -CAPOTIN 50mg 2x [0.25+0.25mg]-GLUCOPHANGE 500mg 1x-GLUCOBAY 50mg 1x-DISPIRIN 300mg 1x-ZYLORIC 100mg [URIC ACID]**********THE ONLY TEMPORARY REMEDY THAT WORKS**********A very temporary cure [30 minutes to 1 hour] is drinking any cola [higher the carbonation, better] while standing and bending low.Drinking warm water helps a little bit as well.Please tell me what can we do about it? This has been very painful not only to the patient but for all family members as well.I can of course provide more info if needed. Any help will be highly appreciated.Thank you very much again.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diabetes 2", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    How can your Type 2 diabetes be out of whack IF your cholesterol is OK and you are taking Meds for your diabetes<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Sudden Onset of Type 2 Diabetes/Symptoms", "tags": ["Type 2 Diabetes", "Symptoms"], "Type1": false, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Hello. Last year at my physical exam, my A1c was 5.7, borderline prediabetes. Since then, for several reasons (stress, mostly) I’ve gained some weight and become less active. Over the last few months, I’ve noticed a marked change in my energy level and I’ve been passing out on the couch immediately after dinner. I have a history of type 2 diabetes in my family and am a 51 year-old male. I guess my question is: can diabetes develop that quickly? Are these ominous signs? My physical exam was last March. Thank you!<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "My wife sugar blood level is 254 wat can or should I do", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 8, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    How do I lower her blood level and is she in danger how do I lower her sugar.help<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Where/how can i find a qualified dietitian?", "tags": ["Treatments", "Diet", "Living With", "Type 1 Diabetes", "Symptoms"], "Type1": true, "Type2": false, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Hello all, I'm 56 and since a few years now I have been battling both Psoriasis and Psoriatic Arthritis and had been changing my diet little by little accordingly.Right now though I plan to start on a serious diet for that but thinking I may as well also adjust my diet plan to try to prevent myself from becoming diabetic or at least minimize the chances since my mom is a diabetic who started on insulin last year at age 74, my dad is not diabetic.. So the diet plan I will need to follow for Psoriasis will be gluten-free/lectin-free/dairy-free/sugar-free/nightshade free but of course there will be foods which may be ok for me to eat for Psoriasis but not good for diabetic purposes and vie versa and is the reason I am asking here.Can you guys advise me on how I can best go about finding a dietitian or nutritionist who would be qualified to address diet needs for BOTH Psoriatic Arthritis and Diabetes prevention please? Thanks, Mike.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diabetes and workout supplements", "tags": ["Exercise", "Diet", "Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 11, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I wanted to know if it's safe for a type II diabetic to take workout supplements. I'm on metformin and I've altered my diet and have started working out. I need to lose 40lbs and in the process I am trying to gain 10 lbs of muscle. In addition, I've had 3 spine surgeries and 1 knee surgery. I am cleared to workout, but I wanted to give my body the best conditions to get stronger and healthier. I've brought my A1C down from 13.1 to 9.4 in a month, so my doctor is very pleased with the quick progress I've made, but I know this has to be a permanent lifestyle change and I am okay with that. Actually, I am excited about my new life, but I need some guidance along the way.V/RDerrick Jones47 yr old Navy Vet.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Blog: Building a Better Breakfast", "tags": ["Diet"], "Type1": true, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    \"We’ve all heard the saying, “Breakfast is the most important meal of the day,” but the reality is that our busy schedules make it difficult to give breakfast much thought. The majority of us are just struggling to get out the door in the mornings, let alone prepare a fully-balanced meal.\"Find out which key components our blogger Anna Panzarella, RDN, recommends for a well-balanced, diabetes-friendly breakfast:  What's your go-to healthy breakfast?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "I am loosing weight?", "tags": ["Oral Care", "Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I became a type 2 diabetic a number of years back. I have never been over weight. The more I try to keep my glucose under control the more weight I loose. If I loose much more weight my health may suffer.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Carbs per meal allowed", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 6, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    My dr sent me to a diabetes nutritionist who gave me a list to follow. She showed me I could eat no more than 45 carbs per meal. I don't eat that many at most of my meals but Ihave lost 25 lbs. Isn't that too many carbs per meal? Should I get a second opinion? My numbers look good and I feel so much better after losing dome weight. My dr is pleased.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Numbness", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 18, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I get numbness in both right and left arms and fingers at night and it's sometimes painful what can I do to stop this from happening to me any ideas<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "What Is the Somogyi Effect?", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Start getting into the subject of blood sugar, and you may feel like you're speaking another language. Here are some of the most common words and phrases you might hear when you're talking to your doctor about metabolic syndrome, insulin resistance, or diabetes: What was most confusing to you when you were first diagnosed?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Haven't been told I have diabetes but I have right foot issues", "tags": ["Symptoms"], "Type1": true, "Type2": true, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Hi there I'm 37 years old with hypertension, I am getting a diabetes test done, I had a seizure a long time ago fell down a flight of stairs and fractured my ankle now I have broken blood vessels and really bad spider veins, help?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Update: I have now lost 30 lbs.", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 4, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I am a 73 yr old female with type 2 diabetes. I have lost now a total of 30 lbs and all of my numbers, cholestral, blood glucose, blood pressure normal! Would like to lose 15 more. Wish me luck!<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Hello. Info", "tags": ["Exercise", "Insulin", "Treatments", "Diet", "Living With", "Type 1 Diabetes", "Symptoms"], "Type1": true, "Type2": false, "numberOfReplies": 21, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I don't personally have diabetes, but my boyfriend who I have been dating for 8 months now, has it. He didn't understand how to manage it for years (not even his own mother helped from what I can see) and now that he has me he wants to get it under control. It's hard to understand some of it, but I have been reading about it for a while now, and I just wanna understand and talk to people who do have it. I know what diabetes is and how its works because my grandpa had it. My boyfriend just doesn't have a lot of confidence in himself and I want to help him. If anyone could talk to me about living with diabetes and management I would love to talk to you. Right now this issue is a wrench in our relationship, I know that basic things but I want to help him better because I don't think anyone else is. So if anyone has any info they can talk to me about that would be greatly appreciated.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Numbness in finger tips including my nail beds", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I have Type 2 Diabetes controlled by diet. I have been on KETO for about 5 months, lost 30 lbs. One dr diagnosed it as Neuropothy and has prescribed Neurotin, 300 mg 3 times a day to see if that would help. Luckily, I am in no pain but, it's the numbness that is driving me nuts. I keep dropping things and difficult to button shirts and jeans.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Low blood suger", "tags": ["Treatments", "Type 1 Diabetes"], "Type1": true, "Type2": false, "numberOfReplies": 3, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I have a type 1 diabetic 3 years old daughter, under non-insulin therapy controlling the food intake for 6 weeks, we got several results below 50 in a normal health conditions, how is that possible? And what could be the reason in case of no insulin and no other illness?Thanks in advance<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Want to get fit...please help.", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    33 y/o M, Wt. 220 lbs., ht. 167 cm. Race Asian Indian. T2D since 2015. On metformin 500 BID. Have severe gynecomastia, wide hips. Low libido, ED. Married in 2016. Suspect low T, hormone imbalance, low iron, high inflammation. Wife and I want to have a child. what should I do?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "neuropathy and foot pain", "tags": ["Treatments", "Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I am taking Metformin and having problems with neuropathy and just happened to read a letter in the paper in a pharmacy column this man wrote that has neuropathy and he was told to take Vitamin B12 and it helped. So I got some B12 and after about a week I could really tell a difference..my podiatrist recommended getting B Complex next because B6 is also good for nerves. Just thought I would share in case it could help someone else<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Can you control blood sugar without medication", "tags": ["Exercise", "Insulin", "Treatments", "Diet", "Living With", "Type 2 Diabetes", "Symptoms"], "Type1": false, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Hi AllYesterday evening, my blood sugar shot up drastically. Resulted in me fainting and luckily I had my friend at home this time around. But normally I stay alone and if anything terrible like yesterday would happen. Pray to God that it doesn't. I am looking for suggestions some diet ideas to help keep blood sugar levels in check. Like something I should avoid (other than the general sugary stuff, which i do). Also something I can add to my diet which is helpful.I read this article today morning,  Any advise will be helpful. Thanks.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "HbA1c - A1C diabetes and cognitive decline", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Here  The English 10 years study the ADA would not like. Because contrary to it’s strategy to even generally increasing the A1C’s as convenience for patients-, doctors- and health insurances for with reduced live span to save healthcare costs and by increased A1C’s the pre-diabetic and diabetic numbers epidemiology looks also much better. As reminder, any normal healthy A1C is at about 5% since 40 years.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "What should I do if the reading is above 300", "tags": ["Symptoms"], "Type1": true, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    High Blood Sugar above 300<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Discrepancies in blood glucose results", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    When I take my blood glucose, sometimes the results are so very different within seconds of retaking the test. For example, last night it was 169, 202, and 175 within the same minute (of course, I use a new strip each time). I received my new One Touch Verio machine in the last 2 months; test strips are new. I always take my glucose at least 2 times each stick; however, I don't know the correct reading. I realize this is just a guideline, but very frustrating. 169 and 202 are quite different readings. I hope that someone could shed some light on this. Thanks for any suggestions!!! Nonna2015<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Best Meal Plan for Type 2 Diabetes", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I was diagnosed with Type 2 Diabetes a couple of weeks ago.My fasting blood sugar was 155 and my A1c was 6.7.My doctor has given me three months to start losing weight or I will have to start taking medication.Can you please tell me the best plan to follow? I really would like to control this without medication. Thanks for any help you could give me.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Answers-", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 5, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    69 yrs old- Diagnosed about 20 yrs ago -zero complications- Ave A1C is about 6.1 -6.3. However , my morning level is (was)at about 145. Talked to a \"Pro\"- was told something about the \"dawn affect\" Now- the past 5- 6 months- without any change -ie- weight- level of exercise- food intake- its at about 180 or so almost every morning. Doctor told me more water- more exercise- lose another 10 lbs ( Am 5'9 About 180) Plausible that it could go up that high for no apparent reason. Any and all comments/ suggestions would be appreciated. Only Meds I am on is Metformin<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diabetes", "tags": ["Treatments", "Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Hi I had normal ALC reading with no thrist or peeing a lot, but I were always hungry and sleepy after a year i were told I have prediabetes my last reading were 6.3 alc<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Type 2 with poor circulation in my feet", "tags": ["Exercise", "Treatments", "Diet", "Living With", "Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 9, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I am a type 2 diabetic with poor circulation in my feet. What can I do health and diet wise to reverse the poor circulation in my feet.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "The VGO pump for type 2 diabetis", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Hi I just recently got the VGO device and I was told to replace it with my other diabetic medications but now my sugars are running high, I am freeking out<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Type 2 Diabetes can be reversed", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 7, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    ***/\">www.ncbi.nlm.nih.gov/.../       It’s good to know.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "What are the Normal readings", "tags": ["Living With", "Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    What are the Normal readings for Type 2 diabetes? I have a once touch meter and test strips and it gives me a different number than the A1/c does. So what’s below Normal for me to worry about the danger of that and what’s high Normal ?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Atherosclerosis in the lower limb arteries", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 4, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I am a diabetic patient aged 64 years and also had a heart surgery 12 years ago. Lately for the past couple of years, every 2-3 months i am having itching & burning feeling on my lower limbs. When i visited the doctor, doppler test was recommended and diagnosis indicated that i might have to go through stent insertion or angioplasty due to Atherosclerosis. I am still in debate whether to go through the surgery. Could you please take a look at the report in the attachment here and give a opinion ?Thank you<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Too low?", "tags": ["Oral Care", "Living With", "Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    My fasting numbers in the morning have been in the high 70s and 80s. Should I be alarmed? Closer to normal the rest of the day.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "BevLinc46", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I have type 2 Diabetes and on insulin therapy and for the past month for some reason my sugar keeps dropping to dangerous low levels hours after I take my morning in insulin. Don't know what to do<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Bruise", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I recently fell at an event. I bruised my leg really bad. Does my Type 2 Diabetes interfere with healing of the bruise?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Meal Plan Options", "tags": ["Diet", "Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 17, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I am prediabetic and eat best if I have a meal plan.Is there a free meal plan that someone could suggest?Or typical meals that I should be following.Thanks<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "insulin shots upset my heart rhythms", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Hi. I'm looking for some help please. I used to be on an insulin pump but now I cannot afford the pump supplies nor the insulin that always worked for me. I've started using Walmart's ReliOn 70/30 insulin with syringes. However, recently it seems that my heart goes crazy every time I take a larger dose of insulin - 10 units or higher to keep my numbers down. This is why I went to the insulin pump. I have had cardiac ablation therapy for atrial flutter, and I'm worried this recent heart problems will cause me to have to have more surgery. Has anyone else experienced changes in their heart rhythms when they take an insulin shot? I'm trying to figure out whether or not to stay on the insulin or just give it up to prevent more heart problems. Thank you for anything you can share.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Type 2 Diabetic Long term / recent diagnosis", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Friend diagnosed 1 1/2 yrs ago with type 1 diabetes. Informed by doc his symptoms prove diabetes rampant due to yrs untreated. He has been diligent and consistent in all aspect's of diabetic treatment plan. Total life change. All to accommodate his diabetes. He has been declining since discovery. Now type 2 with no progress. He is 48, Hispanic, round 5'7, thin / now thinner. Work's labor. On feet all day. Say'sSay' S can barely get through day due to right leg and feet. Pain in various areas. Any idea what is happening here ? I am trying to help in any way I can. Explain through translation all medical info I find based on health issue's he Shore's. ANY feedback is greatly appreciated. Thank's much.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Just diagnosed with type 2 diabetes", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Been taking meds still so tired can barely stay awake at work<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "I have all the symptoms for diabetes but my blood sugar is only 106. Can I still have diabetes or be developing it?", "tags": ["Type 2 Diabetes", "Type 1 Diabetes", "Symptoms"], "Type1": true, "Type2": true, "numberOfReplies": 5, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    For the past month I have had really extreme thirst, like I could drink 5 glasses of water and 10-20 minutes later I will get incredibly thirsty again to the point of being light headed. I aslo constantly have a really dry mouth and skin and obviously use the restroom a lot due to the water. I told my friend this who had diabetes and he said those are the symptoms he had when he was diagnosed so he tested my blood sugar with his finger pricker and it read 106. So, could I still have diabetes with a level that low or could I be developing it?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "A1C Progression from 0 to Highest Level", "tags": ["Living With", "Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Herd alot about it. Fight to control it. Know its dangerous. Has an effect on the body.Can anyone graph the probable events to the body as the A1C level rises in the body from 1 to 20 or highest level?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Type 2 diabetes", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    what is considered a normal range for sugar reading on meter ?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Type2 diabetes", "tags": ["Oral Care"], "Type1": true, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    What is considered a normal reading on meter for type 2 diabetes?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "A1C results", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I was just informed by my doctor that my A1C is 6.0 and should consider taking diabetic medication. I am 48 yrs old, eat well and work out regularly. During the last month i had the flue and wondered if taking theraflue, nightquil & dayquil could have given a false elevated A1C result???Should i be taking medication?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "please help", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 3, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I have a dear friend that messaged me this evening about his health... I will tell you it scared me to death... please help me understand... They have diabetes and their blood sugar numbers today were 847 in the Doctors office... yes I said 847... There are some factors I know about.. There is a problem with drinking... I am not sure if he is taking his meds for the Diabetes type 2... They also gave him Morphine for the back pain that he has due to an injury from when he was in the military.... I am also confused what are Keytones they are sky high.. maybe the word is spelled wrong.... Would stress make your numbers this high, besides the drinking...<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Neuropathy", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 5, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I have type 2 diabetes with neuropathy, I know there is no cure but is there a Dr. anywhere on this planet that has a solution to the burning that does not offer the implant of something inserted into my back like a pacemaker which I can control when needed. It may not even work and I don't want to be a test subject and my insurance may not even pay for it not counting the hassel of surgery.Please, if there is a Dr. that can offer a solution to my problem because all of the Drs. I've seen can do nothing but srug their shoulders and offer different types of creams that are supposed to help but don't. If these nerves are dying why can't they just be cut and tied off. A stupid idea I know but I am just that desperate, please help.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Borderline Diabetic", "tags": ["Symptoms"], "Type1": true, "Type2": true, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I’ve been told I need to watch my numbers, they’re not quite borderline, but could easily go there. Now my feet have started to occasionally tingle. Am I now a diabetic?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Insulin pump", "tags": ["Insulin", "Treatments", "Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    My doctor recently asked me if I've ever considered an insulin pump. Apparently my pancreas isn't working as well as it did in the past. I know a little about the pump, but what should I consider? I don't really have an active lifestyle, but I do travel a lot. I also love to eat. Food is my weakness.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Type 2 diebetic", "tags": ["Type 2 Diabetes", "Symptoms"], "Type1": false, "Type2": true, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    How high does your sugar level go up when you need to go to see doctor?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Recent type 2 diagnosis", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    ***. They say it's in normal range but everything I have researched said 333 should be the highest. What's your take.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Not sure where to put this -- diabulimia.", "tags": ["Type 1 Diabetes"], "Type1": true, "Type2": false, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Hi everyone, I wasn't sure where to put this, mental health or diabetes. But I do something that the average person would find absolutely alarming. I have type 1 diabetes, and like all diabetics, I need insulin. However, I've noticed through the years when I take less than I need, I burn fat so quickly and I drop weight like it's nothing. I am 5'6\", 105 lbs, and truthfully, I don't look emaciated, I look better than I have EVER. There's just no real information out there about it or therapists who specialize in this, and this site has nothing on it either :/ What do I do? Guys, I need help.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "nugenix testosterone", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    is this product safe to take, has b12 b6 and zinc, testofen, and fenisate<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diabetes and anger", "tags": ["Diet", "Type 2 Diabetes", "Symptoms"], "Type1": false, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    My dad has been on a plant based diet for the last couple of months at the urging of his doctors. He's lost weight, but in the last week he has fallen off the wagon and has been eating mass quantities of cookies, ice cream and candy. He is a Type 2 diabetic and this last week he has been angry and honestly a big jerk (to put it mildly). He's always had anger issues but there hasn't been as much conflict the last couple months until this last week. Is it possible the increase in sugar and his anger are connected?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Afrezza", "tags": ["Insulin", "Treatments", "Living With", "Type 1 Diabetes"], "Type1": true, "Type2": false, "numberOfReplies": 4, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    My 34 year old son , type 1 for 22 years . He has been on Afrezza  (insulin inhalation) which is a rapid-acting form of human insulin that is inhaled through the mouth, for 6 months and loving it .I have has type 1 diabetes for four years . Latent autoimmune diabetes of adults, LADA.I am 59 years old, and have been struggling with A1C, so today I started with my first dose ofAfrezza.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Contaminated Blood Test Kit", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I have just received a new blood test kit. I have had hepetitus B and need to know how to safely dispose of my old kit which is obviously contaminated.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Dhea/Melatonin", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Quick question. Has anyone currently with T2 use Dhea and/or melatonin? Is it anything you would recommend doing? Thanks in advance.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Prediabetes", "tags": ["Diet", "Living With", "Symptoms"], "Type1": true, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I’ve checked my glucose levels two days in a row when I got up in the morning and it was 105, 106. The chart is reading prediabetes, does that mean I have to change my diet just like a person with diabetes?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "High Blood Sugar above 300", "tags": ["Symptoms"], "Type1": true, "Type2": true, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    What should I do if the reading is above 300<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Signs of diabetes?", "tags": ["Symptoms"], "Type1": true, "Type2": true, "numberOfReplies": 4, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    A few months ago, I went to physical therapy for a frozen shoulder. I skipped going to my MD but did have the PT ask for a script from the MD. Therapy going well. A few weeks ago, I noticed an itchy red bump on the top of my hand about the size of a pencil eraser. Thought it was allergies but hydrocortisone didn't work. Went to MD and he advised to leave it alone and it would be gone in a month. I'm anxiously waiting for it to go away. It has shrunk. I find myself looking on the web and see diabetes is common with frozen shoulder and skin conditions. I'm 47, slightly overweight but My fasting glucose has always been 100 or under so I'm not sure if I'm overreacting. My MD didn't mention any worries of diabetes but maybe he just wanted to wait a month. What should I do? Any suggestions as I'd like to start the New Year a better person to my family and not worry about my health excessively. I tend to have anxiety over my health even though I only suffer from very bad allergies. Thanks for replies.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Afraid I have diabetes", "tags": ["Symptoms"], "Type1": true, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Hi. I’m a 15 year old girl and for the last few months I have been hungry all the time - even after eating large meals, give it half an hour and I’m hungry again. I’m also experiencing blurry vision, have been for quite awhile but recently more noticeable in the past month or two. I wet the bed last night for the first time in my life. I’m a total worry wot so I’m afraid I have diabetes. You’ll probably say I do, I’m hoping you’ll say you don’t think so. Thanks<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Out of the Blue...", "tags": ["Exercise", "Insulin", "Treatments", "Diet", "Living With", "Type 1 Diabetes"], "Type1": true, "Type2": false, "numberOfReplies": 18, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I am a 49 year old female, 5'2\", 120 pounds.I have never overeaten, never crave sweets, avoid fried foods, and maintain at least light activity every day.On the day of the eclipse, August 21, 2017, I went to the doctor for a suspected urinary tract infection. The week before, I had visited the doctor for a lingering headache (that I have had for more than a month and finally decided to do something about).To my dismay, the glucose in my urine was 2000+, and so the doctor did an A1C, which showed 11.9.I have been told that I have Type I Diabetes and will now be on insulin for the rest of my life. I do not accept that.Has anyone here defeated Type I Diabetes through holistic methods?I do not want to be insulin dependent forever, and am still trying to understand how \"this\" happened.Cathy Dahl<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diabetes Type 2 Management", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 4, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I was diagnosed with Diabetes type 2 several years ago. It seems to be under control with the medication and food planning but this was disrupted due to medication side effects and trial of various medication. It now seems to be a daily battle to try and just maintain especially since I recently had to start injections. Blood sugar levels are still too high and it is hard to try up beat and hopeful on most days. Any insight or ideas would be greatly appreciated.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Help!", "tags": ["Type 2 Diabetes", "Type 1 Diabetes", "Symptoms"], "Type1": true, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Here recently I’ve had a increase in hunger. Like I’ll eat and I’m still hungry or don’t feel full. I’m also thirsty more than I have been. I’m peeing a ton more as well. I wake up at least twice a night and pee. I’ve also noticed I’m super tired during the day. Also my sublingual glands under my tongue are slowen. Does anybody else think this is diabetes?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "History of OB’s", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 4, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    It’s to remember about 20 years ago when they did fight for its human rights. At some companies they lost the jobs based on OB and latergot incompetence created for them to lose the jobs and this especially at jobs to represent the company’s good image. Resulting court resolutions got created to preserve equal rightsand opportunities for them too and to be confirmed as normal humans. Resulting even airlines got forced to have also special seats for people weights up-to 400 lbs to sit comfortable. They got all the rights and now as seen for T2D also and thepopulation majority resulting became OB including children. The nature usually cannot be fooled, but humans can. There are today so many medical or nutritional opportunities to adjust to ideal or normal healthy body weights, this even under the same lifestyle possibly not able to give-up, that no excuses as about genes etc. possible anymore. (Same as some have problems to give-up smoking, etc.)<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "When is Insulin dangerous?", "tags": ["Insulin"], "Type1": true, "Type2": true, "numberOfReplies": 12, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Hello- can anyone tell me what medical conditions/emergencies/ diseases, basically anything that can happen to someone, would make you not give a diabetic their insulin (when their sugar is significantly high) because it could actually hurt them? Any names of diseases/conditions, like the flu, dehydration, anything. Please let me know, thank you<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diabetes or Anxiety", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I am so terrified I have diabetes. I have been diagnosed with an anxiety disorder in the past, and am currently on medication for it. Right now I wake up shakey, which could just be anxiety but I'm not sure. I don't have extreme hunger, and I don't pee alot either. No one in my family has diabetes. But I am so stressed about this. Any tips?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "question if i can smoke marijuana with my meds", "tags": ["Insulin", "Treatments", "Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 18, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    im on 2000mg metformin and 20mg ran pravasatin every day and im just wondering if i can smoke or take any types of marijuana and if there will be any issues with the medication that will hurt me a lot just wondering because im trying some self medication because of pains<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Metformin", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 4, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I would like to know what I should not eat while taking this medication.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "I’m planning for IVF", "tags": ["Insulin", "Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    My diabetes is poor 158 when to see doctor change my insulin 20 in morning and 24 night before food after taking the insulin glucose monitoring is so high 231-301-223.... what can I do I’m 43 ....<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diabetes?", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Recently had A1C blood test dueTingling/numb/cold? Feet and tingling fingertips. Was 7.5 withAge of 69, 2 cancers. Ok per PCP.Also have spinal lumbar disintegration with age. Seeking answer of “cold feet”. Could it be spinal lumber nerveProbs causing feet/finger tinglingVice diabetes? Is only cure surgery?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Do you think this is allergic reaction also", "tags": ["Type 1 Diabetes"], "Type1": true, "Type2": false, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I found out my daughter's that is 10 is a type 1 diabetic about 6 months ago about a week ago I found out she is allergic to Humalog they are trying her own NovoLog she is having the same reaction they also have her old Lantus for the long-lasting insulin but she has been complaining and screaming of leg and foot pain 15 to 20 minutes after taking it she is screaming in pain was so bad I'm having a wrap her legs and massage her legs do you think she's allergic to that as well<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Pre-diabetic active vegetarian", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 14, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I just found out from my annual physical that I am pre-diabetic. I repeated the glucose test and did A1C and both showed that I am pre-diabetic. I am 116 lbs and a vegetarian with a lot of fruits and vegetables diet already. I am very active as well. Had two pregnancies without gestational diabetes. I am 35 years old. After finding out, I have reduced my carb intake even more, added more minutes in my daily exercise routine but still fasting was 114 and 2 hours after meal was 131. What can I do to lower my numbers?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Type 1, poly neurapothy", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I am 48..diagnosed with type 1 at age 41.. I have an insulin pump. I have large and small fiber neurapothy.. I am supposed to have a bone fusion and toe joint replacement in my right foot..my feet hurt to walk and every day it is getting harder to walk. When going upstairs or walking my legs burn and feel like I’m walking through mud. I am in shape and enjoyed working out until recently..I’ve had to cut my hours back at work. I am working on my a1c which is 8.7. Dr will not do surgery until my a1c is 8. I understand why.. has anyone gone through this? My bones in my feet break and I have had 2 previous surgeries that failed..why are my feet so bad? And hurt so much?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Side effects", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    A few years ago I was taking janumet and it caused severe rash.Doctor prescribed traijent - does it mean that it is more probable that I will get rash again?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Do you think she's allergic to Lantus as well", "tags": ["Type 1 Diabetes"], "Type1": true, "Type2": false, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I found out my daughter's that is 10 is a type 1 diabetic about 6 months ago about a week ago I found out she is allergic to Humalog they are trying her own NovoLog she is having the same reaction they also have her old Lantus for the long-lasting insulin but she has been complaining and screaming of leg and foot pain 15 to 20 minutes after taking it she is screaming in pain was so bad I'm having a wrap her legs and massage her legs do you think she's allergic to that as well<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "High Blood Sugar during steroid treatment", "tags": ["Treatments", "Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I am having issues with my kidney, non-cancerous, Membranous Nephropathy, and have been prescribed Steroids by my Dr, a Nephrologist.My blood sugar, taken daily, spikes with just the least bit of sugar/carb intake, unlike before steroids, where sugar went up mildly. Dr and I expected this but has had anyone had similar experience?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "DIET FOR DIABETICS", "tags": ["Diet", "Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 3, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I came across this concept called LCHF i.e low carbohydrate high fat diet,meaning,one come a diet of 65% fat and not more than 20% carbohydrates.Idea is to avoid dependence on insulin in the digestive process and bring down the blood sugar levels.On the face of it,it looks logical and a boon for diabetics.Are there any long term consequences of this diet.I have heard of disturbances of the gut flora,NAFLD etc.Is there any valid scientific data on this subject? Curious to know.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Am I diabetic?", "tags": ["Type 2 Diabetes", "Type 1 Diabetes", "Symptoms"], "Type1": true, "Type2": true, "numberOfReplies": 3, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Last Thursday, I noticed a sweet taste in my mouth that comes and goes. Called Dr. on Friday, she said my glucose level was 88 from blood test 3 weeks ago and that I did not have diabetes or pre diabetes. I am very worried that I have ketoacidosis because it hasn't stopped and I googled \"sweet taste in mouth\" and this is what comes up.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Always Hot?", "tags": ["Living With", "Type 2 Diabetes", "Type 1 Diabetes", "Symptoms"], "Type1": true, "Type2": true, "numberOfReplies": 5, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Do you always seem to run warm? It could be a result of Type 1 or 2 diabetes. With diabetes, your blood vessels don’t dilate as well as they should, so it makes it harder to bring blood to the skin’s surface to get rid of heat.Find out what can help (and other things that could me making you feel warm), here:  Does anyone here deal with constantly feeling hot? What have you found helps you manage?Dealing with the opposite (re: always cold)? That could be due to type 2 diabetes as well. Learn more here: <BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Frequent & slow/weak urination stream, while taking opiate pain meds long term. Is this normal???", "tags": ["Symptoms"], "Type1": true, "Type2": true, "numberOfReplies": 5, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Frequent & slow/weak urination stream, while taking opiate pain meds long term. Is this normal???I am starting to worry a little. I was told way back by someone in the family that they think that's normal, but just want to be sure?Sometimes it''s so bad even if I have to go really bad, to get my urine stream started. Then sometimes I feel the need to go again minutes after I just went.Should I mention to my doctor or is it probably just the pain meds?By the way I have been taking these meds now on and off for the last 10 yrs due to terrible back problems. I presently take a pretty high dose of 135 mg of oxy per day. 60mg of extended release every 12 hrs plus 2 x 7.5mg as needed for breakthrough pain. I am presently trying to lower my dosage so maybe it will get better as I take less per day, then I will know for sure it was the meds.As for my health other than this, I am in pretty good shape but having to try to get my cholesterol and sugar levels down or the doc says she is going to put me on meds for that. Anyway, anyone experienced this? If so, Please let me know. I will greatly appreciate it!Thanks!<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "what is a dangerous sugar readings after a meal.", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 3, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    what is dangerous sugar readings, I'm a type 2 diabetes. I ate a French toast with butter and my sugar reading is 362.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Nail growth has stopped", "tags": ["Symptoms"], "Type1": true, "Type2": true, "numberOfReplies": 3, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    The end of November 2017, I noticed my nails had stopped growing. Also in the same time frame I ended up with a respiratory infection which after 6 antibiotics, 2 chest x-rays and 5 doctor visits, was diagnosed with asthma. It is currently March 2018 and I am still dealing with wheezing and my nails have started to break (they are still not growing) below the nail beds. None of my doctors including a dermatologist who checked me for fungal issues can give me any answers. I can't believe there is no other documented case in the world where this has happened to a person's nails and no one can tell me what the cause or how to correct it. Any ideas or suggestions would be appreciated.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Traveling with hypoglycemia", "tags": ["Treatments", "Diet", "Symptoms"], "Type1": true, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I imagine people with diabetes have similar issue. I have reactive hyoglycemia, so I can't eat rice, pasta, or other meals high in carbs, otherwise I crash soon after. I need to eat about every 2-3 hours, and need some balance there as well (a quality protein bar is a decent snack, but even with that I crash -- real food, with meat, is the only thing that truly holds me). At home, I always keep 2 snacks with me, and if I'm walking around a lot, like at the mall or a hike, I take something like Vitamin Water with me, which, while I typically avoid sugary drinks, it seems to help to sip it.Coming up soon I'm traveling to Asia for two weeks, including an area of China that's outside any major city. I'm wondering if anyone has tips for this. I'm told to expect limited restaurant choices in these areas (I'm also traveling with a group tour, so I can't choose my own stops), and that sometimes restaurants only have rice/pasta dishes (with a small bit of meat on top). I can eat about 1/4 cup of white rice before it's too much... I'm also told that stores there do not sell protein bars, beef jerky, or anything like Vitamin Water. (I'm told they have dried squid, etc, but not jerky as I know it, and other types of bars, but not decent/any protein bars).I'm really not sure what I'm going to do, and am pretty much expecting to get sugar sick a couple times...Also, anyone know of a powdered drink mix that you can pour into water that has a bit of sugar and other nutrients? I can't seem to find any. I thought about bringing sugar packets...<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diabetic since 1994", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Why was my post change from what I posted.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "If have To Do A Thyroid Test ?!", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Every body cell is linked to the Thyroid, but it gets often forgotten.The Thyroid can cause over 300 symptoms everywhere in the body.Therefore if some tests done, they should been done completely tobe useful as following for the patients to insist on: For Antibodies: 1. TPO-Ak = MAK2. TRAK3. TAK (TSH receptor antibody.) For Hormones: 4. TSH (The brain hormone to regulate the Thyroid.) 5. Free T3 6. Total T3 7. Reverse T3 = rT3 (Important! Free T3 to rT3 Quotient = higher 2 ) 8. Free T4 9. Total T4 Good LuckPS: I just went through this.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Leg cramps", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I get servere leg clamps. This happens mostly at night but also at times during the day. I do have diabetes 2. I keep my blood sugar in check and now I don’t use insulin anymore, I was on it for years. The cramps are so bad, that they wake up at night and I do my best not to scream and wake the entire household. Is there any kind of treatment to help?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Confused goofball", "tags": ["Exercise", "Treatments", "Diet", "Oral Care", "Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 6, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I’m confused as to what I can and can’t eat I read everything at the store how many carbs how many sugars can I have I read 35 carbs 10 sugars I put it down I don’t know so I don’t eat it. Anyone<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diabetic since 1994", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 22, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    At 69 years old my feet were cold and stiff also many small lacerations, I had a retina cyst on my left eye macula and edema on my right eye ready to burst, I had terrible head aches that kept me awake at night, I walk around the house to alleviate my condition, every year I had UTIs, I was taking 5 medications my Blood Pressure was 120/80 and glucose test every morning under 90 (average) my A1c 9, weight 170 # and my glucose high under 200, BP 120/80 and no pills. Why?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Confusing OGTT Result", "tags": ["Type 1 Diabetes"], "Type1": true, "Type2": false, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    ***.is it possible there was no sugar in what I drank? I know my BG comes up when I have carbs. would anyone have a result like this?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "The US Diabetes Situation", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 9, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;     From the publications: The ADA is America's leading 501(c)3 nonprofit charity providing diabetes research, information and advocacy. The ADA raises most monies themselves and their overall fundraising expenses are 24%. In 2016, the ADA’s total revenue was $171 million. -- $40.9 million went to Fundraising and Fundraising Administration costs, 24% of the annual revenue.-- $32.2 million dollars was spent on Research Grants, 19% of the ADA’s annual income and 13.2 million went to Research Administration costs, 7.7% of the annual revenue.-- $51.9 million was spent on Information and Information Administration costs, 30% of the annual revenue.-- $40.8 was spent on Advocacy and Public Awareness and Advocacy and Public Awareness Administration costs, 30% of the annual revenue.-- $11.4 was spent on Management and General costs, 6% of the annual revenue.The organization has engaged telemarketers at very large costs in the past. In one instance, the ADA entered into contract with InfoCision, a telemarketing firm that works closely with nonprofits, whereby only 15% of the expected funds raised would be given to the ADA with the other 85% being kept by the telemarketing firm. Furthermore, the telemarketers were instructed to lie to prospective donors regarding how much of their donation will go to the ADA.The Donations- and Sponsors- Monies mostly from Health Insurances-and Pharmaceutical- Industries, but the ADA says not to have anyConflicts of Interests. As a good example the ADA until today not admitting or guiding howType 2 Diabetes Can Be Reversed. This independent of overwhelmingInternational Evidences for this! ( Prof. Dr. Taylor, Etc. )<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diabetes - Why Making It So Complicate?", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 7, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Diabetes is mainly about controlling the Glucose, Heart and Weight. The problems also artificially created by medications registered forType 1 or Type 2 where objectively some Type 1 medication hasalso advantages for Type 2 and some Type 2 medications havealso advantages for Type 1. It needs to speak with the doctors about to improve the therapies. There is now some attempt to create 5 therapy groups as seen here: (18)30051-2/fulltext?elsca1=tlpr   For example all Type 1 or Type 2 or LADA, etc. some more, should have Basal-Insulin if useful with Metformin in different doses to adjust to the lowest fasting Glucose of 80-90mg/dl. Type 1 and LADA Basal-Insulin with SR Metformin 500mg every 12 hours.Type 2 possibly Basal-Insulin with SR Metformin 1000mg every 12 hours. (Injecting Insulin can be pain free if well done as I do it daily. Additionallyat Type 1 the Rapid-Insulin to meals and at Type 2 this possibly not.As Basal-Insulin I’m prefer the Toujeo because that can daily beenadjusted to observe at following 3-4 days, where for example the Tresiba need 4 days to be adjusted for afterwards to observe atfollowing 3-4 days. The Tresiba creates a perfect straight line, wherethe Toujeo still has a very flat curve with a Tmax but this I like andfor that reason I’m injecting it in the morning to have at evening alittle more effect where I have at evening a little higher mg/dl, forpeople in the morning with a little higher to inject at evening.) Metformin is also reducing heart failure risks. At my son with Type 1and myself I could see the Metformin advantages combined with theBasal-Insulin, because the Liver-Glucose is much better under controland this provides a much easier Glucose managing. There has beenonly one problem, because we both underweight cloud not lose moreweight and daily every 12 hours 500mg SR Metformin is monthly reducing about 1-2 lbs and therefore we did need to stop that. About the Heart and Blood Pressure it needs Potassium supplementing.There is a worldwide Potassium deficiency in the populations and theHeart cannot really function without the right amount of Potassium. This especially by people using some reduced diets or low-carb diet. From my own experience I can tell, by not having any micro-macro-vascular problems resulting neuropathic symptoms and not using diets,just normal homemade food, after over 50 years of SIS 110-120 and Potassium more at normal-minimum, to my surprise got SIS 150-160by myself a little underweight and the feet’s started to get swollen. Since about 3 months now I’m supplementing the Potassium by daily1 Slow-K Tablet every 12 hours and I got back my SIS 110-120 andswollen feet’s disappeared and the Basal-Insulin from daily 18-20 UnitsI could reduce to only 6 Units with the same fasting Glucose 80-90mg/dland the Rapid-Insulin at meals could also reduce to less than half. At Potassium is mentioned, also to regulate the Glucose Metabolism! I can imagine that Potassium at Type 2 can also do a good job. If there are diabetes related other disorders, it naturally needadditional medical considerations or medications. I provided this as from my own experiences and possibly by this canalso give to others some ideas or help.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diabetes and working with sugar", "tags": ["Diet", "Type 2 Diabetes", "Symptoms"], "Type1": false, "Type2": true, "numberOfReplies": 20, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    This may sound crazy, but I did not eat since 9pm the night before, and the next day, at 1030am, my sugar was 140 when it is normally 100-110. I went to work and glazed hams for 3 hours. Is there a possibility that the constant sifting of sugar onto the hams as I glazed worked it's way into my system to cause my sugar to go that high?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diabetes", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Its 31g of sugar is ok for diabitic person<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Confusing OGTT result", "tags": ["Type 1 Diabetes"], "Type1": true, "Type2": false, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    ***.Is it possible there was no sugar in what I drank? I know my BG comes up when I have carbs. Would this be the normal outcome of an OGTT for anyone?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Interesting, Potassium also related to Diabetic Glucose metabolism", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 4, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    By today’s Foods or Diets or Medications there is a worldwide deficiency of Potassium, Zinc, B12, etc. as additional risks of Type 2 Diabetes. See studies at link:  Eating daily two Bananas is preferable for 800mg Potassium, this also for normal still healthy people. By Potassium supplementing within 3 months the Basal-Insulin from daily 18-20 Units gradually can get down to 7 Units, but over time it will be interesting to see if the Basal-Insulin can even be stopped!The meals Rapid-Insulin also got the halve Units. (This above in my case.)<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diabetic Retinopathy", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 4, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Can I get some information on this?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Skin abrasion", "tags": ["Living With", "Type 2 Diabetes", "Symptoms"], "Type1": false, "Type2": true, "numberOfReplies": 8, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    My husband is prone to pimples on his back, which sometimes swell and we have squeezed them in the past and got favorable results. However, two weeks ago, the pain was so intense that we applied hot compacts and squeezed fluid from the site. Now, he has a bruise like abrasion about the size of a piece of large gauze. For a weak the fluid drained pus like fluid, which reminded me of an abcess or the infamous boil.My question is the abrasion, did I inadvertly cause the bruise from squeezing and applying hot compresses. We mentioned this to our physician however, I thought the dark marks would be gone by now. Seeking advice.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diabetic sweating", "tags": ["Insulin", "Treatments", "Type 2 Diabetes", "Symptoms"], "Type1": false, "Type2": true, "numberOfReplies": 8, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    New so if I'm doing this wrong...sorry.dose was 100units +3 metformin daily.lost 29 # deceased insulin to 65units+metformin3.but I am sweating lime a lawn springkler.why? Took 4weeks to slowly decrease.one night I couldn't stopping the sweating had to have sugar. My a1c is 5.5 last 120days..a1c has always been good this is the lowest.usually runs 6.5 to 6.8 for last 10 years.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Toujeo", "tags": ["Insulin"], "Type1": true, "Type2": true, "numberOfReplies": 14, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Due to insurance change I have needed to change physicians. New insurance won't cover U 500 which I've taken for years! New provider prescribed Toujeo 150 units in the am. and 100 units at night. My gut is telling me that is way too much! I haven't started it yet. Anyone else take that much? I'll call them but I'm not very confident in them. They prescribed syringes instead of pen needles twice before I got what I needed and I received no consulting on the insulin change! Thoughts?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diabetes??", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 3, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    What does it mean if my blood sugar tested at 145?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diabetic hearing loss", "tags": ["Insulin", "Treatments", "Type 1 Diabetes"], "Type1": true, "Type2": false, "numberOfReplies": 4, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I am a type one diabetic that has lost a significant portion of my eyesight from neuropathy, I am curious about hearing loss and more specifically what is the youngest age this can occur from diabetic neuropathy?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Need answers", "tags": ["Exercise", "Insulin", "Treatments", "Living With", "Type 1 Diabetes", "Symptoms"], "Type1": true, "Type2": false, "numberOfReplies": 4, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Hi I’m a type 1 diabetic. they said I have inflammation, tendinitis in my should. They want me to get a Cortizone shot and try Pt again. but my blood sugar have been running in the 300 400. I was in a coma about five years ago. that’s when I had a blood clot as well so my question is should I take the shot or try something else?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "What to do", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 6, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I'm scheduled for a stress test and am not able to eat before it. My sugars have been running low in the morning for example It was 61 this morning. I live 90 minutes from where the test will be done. What should I do?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diabetes", "tags": ["Type 1 Diabetes"], "Type1": true, "Type2": false, "numberOfReplies": 8, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Hi there,I was wondering if anyone that is diabetic been told that it's not necessary to check their sugar levels daily. My mother in law's Dr. Said he would check her every 3 months. She was recently in the hospital and her readings we're all over the place.Thank you opinions are greatly appreciated.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Dieabeates", "tags": ["Insulin", "Treatments", "Diet", "Type 2 Diabetes", "Symptoms"], "Type1": false, "Type2": true, "numberOfReplies": 3, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I stay hot all the time so I sleep with the fan on.having burning in my feet anybody else.don't see my Dr for another month. any ideas<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Fixing Dad ...", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I don't know if any of you have ever heard of this. It's a BBD documentary about how a couple of brothers decided to help their father \"reverse\" his diabetes. As we all know, it can't be done without major lifestyle changes but it can be inspiring to actually see how someone did it. Frankly, I found it to be a very positive influence. www.fixingdad.comNot only did they help their father but they brought their family closer.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Reverse Your Diabetes", "tags": ["Treatments", "Living With", "Type 2 Diabetes", "Type 1 Diabetes"], "Type1": true, "Type2": true, "numberOfReplies": 3, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I have T1, and I have reduced my insulin usage by more than 50%. And as a side I lost over 40 lbs! T2 is totally reversible. Most doctors don't know about this because they have little or no nutrition training in medical school you need to eat a Whole Food Plant Based diet and make it a lifestyle. I felt so lied to at first but then realized they just were never taught. Read Eat to Live or the End Of Diabetes by Dr Joel Fuhrman and join the Facebook group Eat to Live Diabetes Support Group. You can get off all your meds and T1s can get much healthier at ANY age!<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Safety of Diabazole", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I have been a type 2 diabetic for over 25 years. After a kidney transplant I had to start taking insulin. I take prednisone & immunosuppressants. I am very careful,of my diet & exercise an hour 6 days a week. I have reduced my insulin drastically in the last 6 months.I want to control my diabetes thru natural supplements. I have heard many great reviews on Diabazole, but am concerned. As a person on immumesuppressants & anti rejection meds, need to know if there is any documemtation /research as to if safe for me<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "What Do You Do To \"Fight\" Diabetes?", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 29, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    In order to beat Type 2 Diabetes, you have to \"fight\" to improve your health.What stands in the way of most people, newly diagnosed with Type 2 Diabetes, is themselves. They refuse to look for simple ways to make improvements in their health. They think, \"I'll just let my doctor tell me what to do.\" There's two problems with this line of thinking:1. They don't follow anyone's advice, let alone, their doctor's, and2. Their doctor only see's them for 15 minutes every 6-12 months (What about the other 262, 775 minutes?).It's the cumulative healing power of the \"little things\" one performs during the course of each day that's the real \"doctor\" in the fight against T2D (and every other lifestyle disease). Here's a few examples of some small lifestyle practices that can make a big impact on this disease...1. Upon waking in the AM, drink as much water as you possibly can. I drink 3/4 of a liter, workout for one hour, drink 1/4 of liter of water, then, drink a cup of coffee, no sugar. If properly hydrated, you should pee all of this out in about 90-120 minutes. If not, you ain't \"properly hydrated\" (dehydration is at the core of most health issues, today).2. I thoroughly rinse my mouth out with warm water after eating. This limits bacterial growth in the mouth that destroys the enamel on teeth and can contribute to inflammation in the gut.3. Emotional wellness is good for the body. Maintaining a positive attitude and performing \"good deed(s)\" throughout the day places your mind (and body) in a good place. 4. Scrub your skin when showering to exfoliate and open up skin pores. This encourages new skin growth, fights aging wrinkled skin. Remember: Think \"little things\".<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "My recently deceased 73 yr old sister", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 13, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    My sister had been in the hospital 3 times in 3 &1/2 months for a week in December 2017 again in January from the 10th-16th, 2018 and for 25 minutes on February 16th almost 2 months ago. In Dec. her glucose was normal at 103-108 and in Jan. normal again at 101-105 but she was taken by ambulance on Feb. 16th, unresponsive and treated with heart jump start meds and shock. she died 25 mins after she went into the ER. While reading her medical records I saw that her blood sugar was at 30 when she arrived at the ER!! What would cause this to happen? I'm thinking an overdose of insulin. My other sister and I had never heard that she was diabetic, but the coroner said her death was caused by her heart stopping due to kidney failure, due to her diabetes...what? Like I said her glucose levels were normal up until the day she died. What in the world caused this drastic change? 108 her highest then plunge to 30!I would truly appreciate any input on this, I need to find closure and with the circumstances that surrounded my dear eldest sister's death is leaving me with a very strong gut feeling that there were other factors involved. possibly even foul play.Thank you,Must find the answers<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diabetes", "tags": ["Treatments", "Type 2 Diabetes", "Symptoms"], "Type1": false, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I have been taking my metformin on/off what, how is affecting my body?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "insulin", "tags": ["Insulin"], "Type1": true, "Type2": true, "numberOfReplies": 4, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    why we have to discard insulin after 28 days, because i ask in pharmacy but they could not answer or did not want to answer me.... and there is a problem the insulin past the 28 days .... thank you and have a great day to all....<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "T2 info", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 7, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    What happens to a person who has type two diabetes if they stop taking their meds<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Where 2 wear pump....", "tags": ["Insulin", "Living With", "Type 1 Diabetes"], "Type1": true, "Type2": false, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I am a female & I have a tslim insulin pump but lately im getting tired of my waist pouch! i want to just where it in a pocket or somewhere else... Anyone out there have ANY advice???? Thx! Take care..Sara M<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diabetes", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    What is the borderline suger number?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diabetic Ketoacidosis and Urine", "tags": ["Insulin", "Diet"], "Type1": true, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    If your body is able to eliminate excess ketones from its system by peeing them out, then how do people have such high ketone levels, such that would cause ketoacidosis. Additionally if one (a non- diabetic) were on a ketogenic diet, and took an excessive ammount of exogenous ketones, could they get DKA?Thank you<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "read about the Keto Fast diet", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    With type 2 diabetes, on metformin, and high blood pressure meds, is it ok to take the Keto Fast?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Ceylon Cinnamon", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 4, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I am a Type 2 Diabetic and I am also insulin dependent.I have been researching about starting to take Ceylon Cinnamon and I was wondering if anyone knows if it is safe to do this since I also take insulin?Thanks for any help, I appreciate it.JoJo<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Rising blood sugar", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 7, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    How come, and this happens often, if I check my blood sugar 2 hours after eating and I check it a few hours later before the next meal, it is considerably higher. And I have not taken in any carbs. Generally just water and perhaps black coffee but mostly just water. This has happened a multitude of times the last few months.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Meal Replacements for Type II", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 4, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Is it a good idea to use meal replacement shakes for breakfast and lunch if you are type II?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "kara keto burning capacity more for the next 24 time than just doin", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    pace/intensity into kara keto aerobic exercise or aerobic exercise schedule. Recover by doing several of minutes of constant condition activity before kara keto next quick amount burst. Analysis this will enhance kara ketog regular aerobic exercise sessions. Tip 2) Nutrient Intake - What happens is that kara keto body system will adapt itself to developing weight-loss more complicated. The key is to make sure that you vary kara keto calorific intake so that kara keto body system can't adapt. For one day of each A 7 days add in some higher vitamin foods, kara keto kara keto burning capacity will stage up a gear and take care of those extra vitamin intake before kara keto body system turns them into kara keto. This will break kara keto weight-loss stage before you jump on the scales again. Tip 3) Protein And Vegetables - Its a truth that its harder for one's whole individual body to digest necessary proteins and fresh vegetables than carbohydrates meals so this will enhance kara ketokara keto burning capacity overcome kara keto stage. Plus they don't cause a rise in kara keto blood flow blood insulin stage which carbohydrates meals do. As you take in carbohydrates meals and improve blood flow blood insulin you are turning what you eat into kara keto mobile operate area and reducing down the amount of quick dropping. Target the necessary proteins and fresh vegetables as this can be one of many aspects you are on kara keto platea Are you asking kara ketoself, \"how can I decrease 20 body weight fast?\" If so, I have some recommendations I  <BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diabetes and gangrene", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    My 85 year old aunt that lives in Mexico City has gangrene in her toes and she is diabetic. She is currently anemic and their form of Medicare say they cannot treat her. Another doctor has been consulted and the family is being told they need to cut her toes and he can do it for a price. What are the chances of the gangrene not continuing to spread and healing properly. Why would being anemic be a reason for their Medicare not to do anything for her. I am sure there are good doctors in Mexico City, but where to find a good one that can be trusted to do what needs to be done and that the family can afford (they live on a small pension).<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "A1C levels in seniors", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 5, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    DOB: 06-18-I940I have been taking 1500 mg of Metformin daily & my recent a1c levels are 5.5! Today my physician told me it is too low and wants it to be around 7!I also like Metformin for its anticancer & longevity claims. We decided to lower the dosage to 500 mg daily.1. What is ideal level of a1c for my age group?2. Claim by an Israeli scientist that metformin not only reduces some types of cancer but also it prolongs life!Your opinion, please.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Crickets", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    That's the result of having a guest \"expert's\" mug on your board for two years, spouting all her glorious credentials and awards, and respond to 3 posts? \"chirp, chirp, chirp...\" A board, like this, needs expert participation and commentary. If there is no diabetes specialist presence, here, anyone who posts a question is left to \"guess\" which responses are most applicable to them. And, if you've read some of the questions, you'd know, lickity-split, that ain't such a good thang. whatever, \"it's your baby\"<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Alpha lipoic acid", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Is it safe as a type2 diabetic to take alpha lipoic acid for neuropathy in my feet 600mg.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Hypoglycemia", "tags": ["Symptoms"], "Type1": true, "Type2": true, "numberOfReplies": 3, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I was diagnosed with hypoglycemia at a early age and have experienced many symptoms, temporary loss of vision,shaking sweating, elevated heart rate. But was told i dont have diabetes. This past week i have been dizzy and sweating and very shakey and loss of breath..If you are hypoglycemic do you also have diabetes?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Support Group for college student", "tags": ["Type 1 Diabetes"], "Type1": true, "Type2": false, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    My son was diagnosed with T1 when he was 16 years old. He’s going to be a sophomore in college. His first year away didn’t not go so well. He was very inattentative to his blood sugar, was hospitalized with ketoacidosis. Then was diagnosed with fatty liver disease. Drinking alcohol has substantially interfered with him taking care of himself. Are there any support groups for him?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Work emergency", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 4, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Guy at work who is diabetic. Has no insulin. Sugar level was 545. Felt like he was going to pass out. We got it lowered to 225. Next day it's at 245 and slowly rising again. He is refusing to leave work unless he just has to. Any suggestions<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Type 2 diabetic: What do these test results mean?", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Test Results: Small focus of gas with questionable tiny air-fluid level deep to theumbilicus. Findings may communicate within the skin surface and simplyrelate to the umbilicus, small subcutaneous abscess associated with theumbilicus somewhat difficult to entirely exclude. Correlation with examrecommended as well as symptomatology in this location.I am having abdominal exploratory surgery on Aug. 16th. Does this sound serious? Serious enough to have exploratory surgery?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Type 1 diabetic with lots of issues", "tags": ["Exercise", "Insulin", "Treatments", "Type 1 Diabetes"], "Type1": true, "Type2": false, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Hi I'm a type one diabetic been type one since I sawSix I'm 36 now I'm bipolar depression I was in a coma about five years ago with a blood clot in my left leg I try to stay active my diabetes is not well controlled my a1c is 7.8 and I have tendinitis is my left shoulder don't know what else to tell you<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "glucose", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I got the results of my Ins physical. How can I tell what the results for glucose and fructosamine mean? Is there a simple chart I can look up?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Mother 53 Y ears is threatening to Kill herself by taking Diabetic Tablets", "tags": ["Insulin", "Symptoms"], "Type1": true, "Type2": true, "numberOfReplies": 3, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Dear All, I need advise can you Please help me? My Mother 53 Y ears is threatening to Kill herself by taking Diabetic Tablets (40 no’s “Glucophage 500 Mg” and some 40 odd numbers of “Priton tablets 4 Mg” she showed us the photo of them)•&nbsp;What should I do as she lives alone during day time at Home?•&nbsp;She has hidden the tablets. I Looked for them but couldn’t find them. •&nbsp;Will she die just taking these Tablets? •&nbsp;I have No Idea how to handle this, our local doctor said She may Go in to a Coma and then Die Eventually.•&nbsp;I have taken advise from Local Samaritans’ too they said that she should not kept alone , But she is refusing to go with us to a friend’s place when we go to work neither she allow us to keep a care taker with her, We can’t stay at home with her as we are employed, and My Son is Schooling. •&nbsp;Have alerted Friends and Neighbors around still am very worried. Please Help me if she takes them what should I do. Will she die immediately?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diabetic", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 3, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Blood sugar has been over 350 for the past week. I have been on antibioticsfor 2 week. Could that be why so high.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Needs simple suggestions on diet", "tags": ["Exercise", "Living With", "Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Hi, I need to lower my A1C to prevent having to go on meds for type 2 diabetes. I'm not good at following diets because I travel a lot for business. So I'm looking for a simple list of avoid these foods and eat this instead that can travel with me. Anyone know of such a resource. Also tips on exercise on the road can help me too.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "fasting", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 7, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    any tips on proper way to fast especially being a diabetic?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Intermittent Fasting & Diabetes 2", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 4, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I have tried intermittent fasting the last month or so, and I actually gained a few pounds. Has anyone else tried this and if so what have been your results. My A1C tested yesterday at 6.30, up from 5.7. I am quitting this and going back to eating more regularly and see what happens.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "High AM BG after fasting", "tags": ["Type 2 Diabetes", "Symptoms"], "Type1": false, "Type2": true, "numberOfReplies": 5, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I check my BG before bed, and my average is 85. I then take my metformin and go to bed. When I wake up in the morning, my BG is averaging 98.I'm aware that this happens with diabetics that are on insulin but I was under the impression that this was not common with diabetics on metformin. Has anyone else experienced this?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Type 2 Diabetes and needles", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 11, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I have Type 2 Diabetes..and have been told that I should check my blood sugar..the thing is..i have this thing about needles..so..how does one do the blood sugar check then?? Its not really a bad fear but nonetheless..just a thing..I do go once a month to a local HEB when they do blood sugar testing there second Saturday of each month..and I see the doctor every 3 months..Is there an easier way to test blood sugar at home??<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Fasting Sugar 140. 160 after 2 hours, 200 after 4 hours and 160 after 5 hours", "tags": ["Living With", "Type 2 Diabetes", "Symptoms"], "Type1": false, "Type2": true, "numberOfReplies": 5, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I am 46 and am diabetic for the last 10 years. My fasting sugar is always about 140. After 2 hours is 160, 200 after 4 hours, 160 after 5 hours. Is it okay?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diabazole", "tags": ["Treatments", "Diet", "Type 2 Diabetes", "Type 1 Diabetes"], "Type1": true, "Type2": true, "numberOfReplies": 12, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Do you know anything about Diabazole? I came to know about it online the other day for the first time.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "New information?", "tags": ["Insulin", "Type 1 Diabetes"], "Type1": true, "Type2": false, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Does anyone know any new technology, studies, medications or information regarding Type-1 diabetes ? I'm interesting in learning about the future of this disease and haven't heard anything new lately.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Hello?  Is anybody home?", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 5, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    What happened, here?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Medical marijuana treat for person with diabetes", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 7, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    My mother has been suffering from Type 2 Diabetics for more than two years. Actually, it has been found out only a year ago as the symptoms of it were mild and we didn’t notice it. Now she has been diagnosed with neuropathy. Doctor said that diabetics might have been the cause for it. She is having the tingling feeling, numbness and sharp shooting pain. We took her for physical therapy, but she didn’t have much benefit from there. She always complains about the pain. One of our relatives suggested us to take medical cannabis in order to reduce the pain. Is it possible for diabetic patients to take medical cannabis? I don’t know much about it. Our relative asked us to go to a medical marijuana in British Columbia (  ). What do you think? Should we give it a try? Is it worth it?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "all of a sudden not being able to run?", "tags": ["Type 1 Diabetes"], "Type1": true, "Type2": false, "numberOfReplies": 4, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    in the last 2 weeks i noticed that i was unable to run without pain or cramping in the back of my legs? I've lost about 20 lbs in the last 6 months. I way 215 now and I am 5'10\". I felt like it was my sciatic nerve that was the problem but, it came all of a sudden and i am actually lighter than i have been in a long time! I've been a diabetic since 1983 and was born in 1964. I started reading that being a diabetic for so long could cause nerve issues or damage? In my case from reading possibly, peripheral nerve issues? Can this be cured if this is the case? Could it be a potassium or magnesium or lack of some vitamin or water? I ask this only because when i try to run i feel like the back of my legs are starting to cramp up or something is going to tear? I would be so grateful for your advice or steps to take to try and resolve this recent problem that i have! Thank you<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diabetes", "tags": ["Treatments", "Type 2 Diabetes", "Type 1 Diabetes", "Symptoms"], "Type1": true, "Type2": true, "numberOfReplies": 3, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    my father die 17 years ago he had diabetes also my aunt so what are the possibilities of me and my children's get diabetes ? also one of my sons drink a lot of soda that may be increase the chances to get diabetes?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Do I have diabetes? Curious about numbers", "tags": ["Insulin", "Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Today I was thinking about my health and was curious to see how my blood sugar levels are. So when I was at the store I brought a device with the test strips. I probably did over 20 different samples. I ate a lot of crackers and pretzels around 130-2pm. I started testing around 5 and finished around 530 just to get a string of numbers and to get the hang of it. I’ve never been diagnosed with diabetes or have symptoms but here are my values. 137 130 203 215 100 110 90 112 129 142 118 145 118 129 145 118 46 142 Those are some of the values I started recording. I know the numbers vary a lot. I’ve been trying to get the right amount on the test strip. Sometimes I would flood it, some times I would almost fill the entire little box up, fill it, and not fill the strip all the way. Later on 3 hours after I ate my dinner I tested my sugar again. I got a reading of 97,112,120, and before I went to bed it got a reading of 116.The next morning I woke up and got a reading after not eating for 12 hours a score of 107. Which is above the recommended fasting range of 80-100. So I tested a few more times ten minutes later and scored 112,108,86,99,94, and 92. A few hours later I ate a frozen dinner for breakfast and had my coffee and two hours after eating I tested again and got another series of numbers. I got many numbers in the low 100s, some in the 110-120 range and two in the 130s. I guess that’s in normal range. I also was looking at my blood test results from my doctor from the past years. Here’s what they had.February 2016 fasting glucose 94 (they put it in as fasting but I know I wasn’t at the time)October 2016 random glucose 79January 2018 random glucose 86.They were all in normal range but the thing I’m worried about were the higher values I got at home when I first did it and the 107 when I first got up. Should I worry about being diabetic or am I putting too much thought into it. I’m so worried about my health and I can’t help it because I have OCD so I keep on obsessing. Sorry this is so long but I’m just worried about my health. Am I fine or do I have something to worry about?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Important query regarding Sugar Test", "tags": ["Type 2 Diabetes", "Type 1 Diabetes", "Symptoms"], "Type1": true, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I am non diabetic. Female, age 32, height 5 ft 7\" and weight 58 Kgs. I keep my weight in check with a proper diet. I have a big sweet tooth and eat a lot of sweets. A recent Sugar test had the following results - GLUCOSE, FASTING, PLASMA - 102 HBA1C- 5.4 MEAN PLASMA GLUCOSE - 108.3 Does this mean I am prone to diabetes? Will I get diabetes soon?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Cost of insulin", "tags": ["Type 1 Diabetes"], "Type1": true, "Type2": false, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I got a new job and they said they would have benefits on the first day. Went to go refill my prescription 2 bottles of Lantus and 2 bottles of Humalog and the price was almost $1240, for both prescriptions so about $620 for each one they were pretty close to the same amount and this is a one month supply. So I had to find $1240 to get my prescription and the insurance company would mail me a check for the amount. Why are the prices so high?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "a1c chart for seniors", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Thank you for your reply.Could you please send a link to the a1c chart.Thank youShah Malik<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Talking Constant Glucose Monitors", "tags": ["Exercise", "Insulin", "Diet", "Living With", "Type 1 Diabetes"], "Type1": true, "Type2": false, "numberOfReplies": 3, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Do talking constant glucose monitors exist? I'm asking on behalf of my amazing father who manages his diabetes while being completely blind! Thanks to a talking glucose monitor, which he uses four times a day, he is able to keep track of his glucose readings. However, what we have heard about constant glucose monitors sounds great! If it would tell him what his glucose levels are throughout the day, he could take even better control of his diabetes. Again, I stress that he needs it to speak his readings out loud, since he cannot see them. Does such a product exist? And if so, please tell me where I can get one, please, for me and my dad. Thanks! Lisa<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diabetes", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    My recent labs said my blood glucose was 126 my Dr said this does not warrant medication yet but exercise and losing weight will bring it down. Am I pre diab etic? My mother and brother took oral diabetes medication and another brother takes insulin<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "At our wits end...", "tags": ["Treatments", "Type 1 Diabetes"], "Type1": true, "Type2": false, "numberOfReplies": 5, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Our 22-year-old daughter has had Type 1 diabetes since she was three years old. Over the past eight weeks, she has been hospitalized seven times, sometimes in ICU. A few of those times, she was in DKA...one time, it was almost fatal. Her symptoms always start with intense, uncontrollable vomiting. The doctors' diagnosis is always \"diabetes mismanagement.\" But her A1C is always good. She has had to drop out of school and move back home, where we have been monitoring her diet, sugar levels and insulin, and all are in compliance. Still, the cycle continues. The hospital stabilizes her, sends her home with the same instructions, then within a matter of days, we have to take her back to the ER. She has been diagnosed with mild gastroperesis, told to eat six small meals during the day rather then three large ones, and was prescribed Reglan...all to no avail. As I write this, I am preparing to take her to the ER again. Advice from anyone who has experienced this uncontrollable cycle would be greatly appreciated.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Dizziness", "tags": ["Exercise", "Insulin", "Treatments", "Diet", "Living With", "Type 2 Diabetes", "Symptoms"], "Type1": false, "Type2": true, "numberOfReplies": 6, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Has anyone experienced any dizziness with their type 2 diabetes?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Wearing cgm AND pump!!!", "tags": ["Living With", "Type 1 Diabetes"], "Type1": true, "Type2": false, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Please, any advice is appreciated!!!Im wearing a pump & a cgm currently with a waist pouch. But i want options! Maybe something different. Even if i create something new..,,Any ideas???<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Questions about trulicity", "tags": ["Treatments", "Type 1 Diabetes"], "Type1": true, "Type2": false, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I am an insulin-dependent type 1 diabetic my position has recently put me on trulicity which I understand is not for type 1 diabetics should I be concerned.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Fighting Diabetes alone", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Hi fellow PWD<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Confused", "tags": ["Type 2 Diabetes", "Type 1 Diabetes"], "Type1": true, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    My fasting blood sugar is 7.4 and 2 hours after 75 gm glucose it is 6.0.Am I diabetic?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Eating habits for 12 hr work day", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I'm having trouble controlling my eating habits with my job on type 2 diabetes I work 12 hrs a day..I have high triglycerides in 900s..I'm taking 2 pills for diabetes Janumet and a new one my numbers avg around 160 just hard to eat healthy and any ideas I could have for fast meals?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "I've often wondered...", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Do you notice every question asked on this board never pays reference to their family...moms, dads, spouse, sons, daughters, grandkids, nephews, nieces, etc? Do you notice, nobody ever says, \"I wish to learn how to deal with my diabetes so, that way, I can 'show' my children how to deal with this (condition) since it has very strong, family correlation.\" I've often wondered why diabetes is viewed by people with such a \"whoa is me\" attitude... \"Do I have it?\" \"Maybe I don't have it?\" \"Can anyone tell me if they think I have it?\" \"Can these (symptoms) mean something, else?\"It's suspected that more that 80 million Americans are either diabetic or prediabetic. If you don't have it, NOW, what (in god's green earth) makes you think you want have it, next year? 5 years from, now? What I'm suggesting is really quite simple, here. What the hell difference does it make????? Does this mean you're going to continue to smoke, eat donuts, M&Ms, hotdogs and french fries until your doctor tells you, \"I'm sorry to have to inform you, but...you have Type 2 Diabetes.\"? What kind of family \"leadership\" is that?Could it be, only single people visit this board?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Anti-Hypogenic Therapies", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Beside of achieving the normal bodyweight for necessary preconditions, that’s the smart way of therapies, but it means just a handful of older medications can be used with some supplements. I’m prefer older medications where the long-term side effects known. Anti-Hypogenic Medications:1. The old Metformin by possible max. dose of daily up-to 2500mg. 2. 24 hours Basal-Insulin as Toujeo or Tresiba. Here the Insulin which generally is Hypogenic as Anti-Hypogenic declared, because it can been fine adjusted in such a manner that Hypos by the Basal-Insulin are impossible. Attention, for example Levemir is not a Basal-Insulin as seen at its diagram where it has a huge mountain with hugeefficiency falling afterwards. Real Basal-Insulin as the two abovehave in the diagram a nearly flat horizontal line and because ofthat they can been adjusted for not causing any Hypos and by this set at lowest Fasting Glucose of 80 – 90 mg/dl to be OK. (T1D, Etc. has additionally the Hypogenic Rapid-Insulin for meals.)3. The old Glucobay to support any therapies at Glucose Upsideis a smart supplement, because any regular-sugars at about 90%get not digested anymore just fermented into facal transformed. At daily 2 – 3x 50mg it has nearly no side effects, where at itsdaily max. dose up-to 300mg it may creates more poops – LoL At its description Hypo risk mentioned, but this is to understandwhen someone got a Hypo and uses regular-sugars it will notfunction to increase the Glucose and therefore Dextrose (is Glucose) Powder has to be used, because the Glucobay will allow it to be digested und will not interfere at Dextrose- or Fructose- Sugars of Fruits to know. Resulting it is reducing the Glucose Peaks and also reducingthe A1C and provides a better easier overall Glucose control. (My client’s usually get it daily 2x morning, lounge-time andthe once not able to stop junk-foods as Ice-cream, Biscuits,Haribo, Chocolate, Etc. and/or have to reduce weight more drastically they get it 3x daily by also in the evening.)  4. Potassium as Therapy Supplement essential for good HeartFunction and Glucose Metabolism. Daily 800 – 1000mg as forexample by Slow-K one day 1 tablet and next day 2 tabletsby the following day again 1 tablet for the AV. 900mg daily. Potassium is not causing any Hypos. Potassium is improvingthe Glucose Metabolism and by that can reduce the Basal-Insulin up-to about 50% as at my own diabetes the Toujeo. ( I made 3 Lab tests within 4.2-4.6 mmol/L ( N 3.5 to 5.1 )Potassium AV. daily 900mg is adequate 2 midsize Bananas. There is worldwide a Potassium deficiency in the populations. 5. Additionally to improve the blood circulation.Every second day ½ tablet Aspirin and daily 600mg Vitamin-E. This is what I use successfully for the A1C less 6% Clients,but if you also like to use something from here, you first would need to speak with your doctor. I’m not using any Glitazones or Sulfonylureas, I don’t like its hypopotential or stressing of the Pancreas and side effects.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Help with diagnosis ideas", "tags": ["Type 2 Diabetes", "Symptoms"], "Type1": false, "Type2": true, "numberOfReplies": 6, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    So I just got home from work and received lab tests back because I felt that I had developed diabetes. I had many of the usual symptoms such as extreme thirst, thrush forming, sensitivity to eating sugar, etc. I was surprised to find out that my A1C was below the normal threshold of 5.7% and my eAG was 111 mg/dL.Is it possible that this test was off or could there be another disease with the same symptoms that wouldn't throw red flags regarding to blood glucose?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Blood Glucose Testers", "tags": ["Type 1 Diabetes"], "Type1": true, "Type2": false, "numberOfReplies": 4, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Please let me know what type of blood glucose testers give correct results and not expensive test strips. The tester I have is several years old and the strips are expensive. I have been buying them on ebay, half the price with usually 50 more strips then what I could buy them in the store. But they are difficult to find at a good price now. The insurance I have doesn't cover the strips. Thank you Rich Frisk<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "A1C", "tags": ["Symptoms"], "Type1": true, "Type2": true, "numberOfReplies": 6, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    How much can an A1C be lowered in a 3 month period with meds, exercise and eating properly?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "I’m 36 yrs old", "tags": ["Insulin", "Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 6, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Hi<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Trip to Ireland", "tags": ["Insulin", "Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    My husband and I are going to Ireland this summer.He takes both fast acting and slow release insulin.Any thoughts on how to keep his insulin at a safe temperature both on the plane and in Ireland?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "lab results", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 3, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    got my lab results back. My glucose levels are at 104, my BUN is at 27, my Ha1c is at 6.3 and my egfr black is at 72 with my egfr at 60. Pointing towards pre-diabetic?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Carbohydrates", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Does anyone know what the conversion rate of carbs to sugar might be?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diabetic insulin", "tags": ["Insulin", "Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Can I take insulin after my meal??<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Help w/hypoglycemic episodes", "tags": ["Treatments", "Type 1 Diabetes"], "Type1": true, "Type2": false, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    My 12 yr old grand daughter has been struggling with type 1 w/ketoacidocis now for 1 yr. within the last three months she has had four seizures due to her levels dropping during the night to the twenties. Even when she gets to the ER it takes the doctors forever to get her glucose back to a safe level. Her doctors insist that her parents are over injecting her; this is not the case, they claim this is impossible and would only happen with to much insulin. What else, and has anyone else, ever experienced this?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diabetes and Exercise", "tags": ["Exercise", "Type 1 Diabetes"], "Type1": true, "Type2": false, "numberOfReplies": 10, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I need advice. I have been exercising for over a month daily but still have not lost any weight. I think part of the problem is the amount of calories I need to consume during the exercise so I dont go too low is too much. Sometimes I need 3 glasses of juice. I know that exercise is good regardless but if anyone has tips on what to do to maintain their glucose levels while not consuming high calorie drinks, I would love to hear about them. Thanks!<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "New Treatment for Type 1 diabetes", "tags": ["Treatments", "Type 1 Diabetes"], "Type1": true, "Type2": false, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I’ve been a type 1 diabetic x8yrs. now due to having gallstones blocking my bile duct and destroying my pancreas. Was put in a medical induced coma and giving very low odds of surviving an acute pancreatitis. Woke up a month later from the coma a type 1 diabetic. My C-Peptide is 0.6 and I take Novalin 6 units at meals and 6 units Levimir at bedtime daily. I’ve gotten a gastric bypass x 3 years ago to keep my weight down w/ controlled BS between 100-170. My AIC is 6.3... never been higher. My issue: Finally got things under control and my Endo now wants to change my insulin. A injectable hormone called Ozempic. You take this just like insulin once a week only. Been reading about this drug....lots of side effects. Nausea, vomiting, kidney issues, and Thyroid tumor growth in rats. Constipation or diarrhea, GI upset or abdominal pain, dizziness, headaches....and the list goes on. This med is used for Type 2 diabetic treatments. Not Type 1 ! Why would this hormone med even be an option for Type 1 ? Sounds dangerous! Is anyone out there taking this drug for Type 1 and is it working or not for ya? Am I risking my life by trying this? Is this drug safe as they claim?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "type one diabetes", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    My grandson is a type one diabetic for 18 years now.One year ago he had stem cell treatments for diabetes and now he is having blood sugar lows ,once as low as 16,when he has not taken any insulin.Tests have not shown his pancreas to be working but something is happening and we're looking for answers.Any help would be appreciated.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Informative", "tags": ["Exercise", "Insulin", "Treatments", "Type 2 Diabetes", "Type 1 Diabetes", "Symptoms"], "Type1": true, "Type2": true, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Hello,I want to share with you a video about diabetes being managed in a holistic manner. Video is educational, informative, and up to date with our current medical science. <BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Glucagon-like peptide-1 analogues for type 2 diabetes", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    A 58 year old woman attends a diabetes clinic with type 2 diabetes of seven years’ duration and no history of macrovascular disease. She is obese (body mass index 37), but says she eats a healthy diet and describes this. Her blood pressure is 134/78 mm Hg, and she has microalbuminuria, but normal renal function and a lipid profile within target levels ranges. She is taking simvastatin 40 mg daily and perindopril 4 mg daily. Glycated haemoglobin (HbA1c) is 8.3% despite treatment with metformin 850 mg three times a day and gliclazide 160 mg twice a day. How would you best manage her hyperglycaemia? (The table⇓ shows the drug treatment options.)After discussion with the patient of the benefits and risks of the available treatment options (including the “do nothing” option, risks of hypoglycaemia, and effects on body weight), you agree on a glucagon-like peptide-1 (GLP-1) analogue (exenatide or liraglutide). Visit  to know more about Glucagon-like peptides.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "15 yrs Diabetic - Insulin", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Age Beyond Current Clinical Guidelines ????Does anyone know of Blood level, etc. Charts that would guide a 88 year man. Charts I have are based for a average 20 year olds !!!<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diabetic Neuropathy related?", "tags": ["Type 1 Diabetes"], "Type1": true, "Type2": false, "numberOfReplies": 3, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I am a 45 year old male. Ever since last summer, I have had swelling along with numbness in both feet and ankles along with leg pain, weakness, hip and thigh aching along with back stiffness. This started to happen all at the same time. My lower back gets \"tweaked\" fairly easily also. I cannot walk very far without my legs getting exhausted and hurting. The right foot being the more numb always and the right leg having the most pain and weakness. The swelling in my feet and ankles is the same for both and it is sometimes worse, sometimes better, on a daily basis even though it is minor yet consistent. Had an MRI done at VA hospital. Have \"mild to moderate\" spinal stenosis. Had lungs x-rayed and kidney function tests (by my request, not the VA primary care doctor's) to rule out those possibly being a problem leading to the swelling. Primary care doctor at VA had a blood test to see if I possibly had excess water retention in my blood. Sees no reason whatsoever to do a heart echocardiogram or anything of that sort to test my heart to see if that may be a possible cause of the consistent swelling in my feet and ankles even though I inquired to ask that it be done.By my request, I had a referral to a neurologist. Had both an arterial and nerve conduction tests done being requested by the neurologist (neuro surgeon). Arterial test normal. Nerve conduction test revealed \"more than moderate\" L5 nerve neuropathy on my right hip and thigh. Neuro surgeon did not elaborate cause of feet and ankle swelling except to tell me that it was \"just a little\" and only that my peripherial nerves coming from my spine where the stenosis is were the cause of my feet numbness. I was told by primary care doctor at VA that my lymph system \"is\" compromised (lymphedema) due to nerve issues in my lower spine, however, there is nothing listed anywhere I have looked saying that could ever be caused by nerves, nor anything anywhere else that I look up can give me a conclusive answer as to whether nerve issues can or cannot cause any type of swelling anywhere at all whatsoever....even though I have seen numerous people on health forums describing swelling issues with feet an ankles along with having spinal nerve issues (herniated discs, spinal stenosis, etc.).<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diabetes.", "tags": ["Exercise", "Insulin", "Treatments", "Diet", "Living With", "Type 2 Diabetes", "Symptoms"], "Type1": false, "Type2": true, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    If a Young man with a age of 38 years with regular gym for 1 hour has Fasting sugar 109mg & BMI of 25 history of Diabetes in Father. How long he can have phase of pre diabetic & getting into Diabetes from Pre Diabetic phase. Please advise. All other parameters are good. Serum lipids Normal.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Feet massagers", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Are there any feet massagers on the market suitable for a person with diabetes?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "48 years old with type 2 diabetes.\nMY A1C level is Very high at 16", "tags": ["Exercise", "Diet", "Living With", "Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 7, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I really need help lowering my A1C levels and get my diabetes on track. I have lost my drivers license for the time being.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "I'm scared", "tags": ["Type 2 Diabetes", "Symptoms"], "Type1": false, "Type2": true, "numberOfReplies": 6, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I'm new to the diabetes 2 game and I think I may have ketosis. What are the symptoms and do I need to go to the ER.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Have not been diagnosed diabetic!", "tags": ["Diet", "Type 1 Diabetes", "Symptoms"], "Type1": true, "Type2": false, "numberOfReplies": 7, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Keep feeling horrible. Having episodes of feeling shaky, feeling like passing out, getting weak. Heart starts pumping harder little faster.checked blood sugar. Last night after eating small steak, mash potatoes, squash. 10 min. After was 73, 30 min. After was 84. Ate a low-fat strawberry yogurt . Hour later was 110. Didn't feel.thst well. Felt like I was freezing.just don't know what is wrong!<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "juvenile diabetes", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 4, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    a little girl we keep on week ends age 4 .. may have diabetes last doctor visit her doctor said her blood work looked funky. next visit will recheck.. i am a diabetic type 2 . but i know very little about Children .can you clue me in .i hope and i pray that it show negative . any info will be appreciated<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "i need to know my goal when i test my blood", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    What is the optimum numbers for a blood test in the morning and in the evening. i weigh around 275 lbs, am female. and i'm 60 years old<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Fasting Blood Sugar", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 14, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Just had my blood work done.My blood sugar fasting was 168 and my A1c was 6.5.My doctor said that was fine.For several years my fasting blood sugar has been 130 and above and my A1c is slowly getting higher.I test my fasting blood sugar several times a week it is 140 and above. One hour after breakfast it is usually 210 or higher.Should I be concerned about these numbers?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Blood sugar levels", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 3, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I have had type II diabetes for over 10yrs. I take 1000mg of Metformin with breakfast and 1000 mg with dinner. After I had a 9.4A1C read I got back in gear with my diet and exercise. It took longer to get by bs levels back down but they did come down after about a week. Im keeping track of what I eat and record my bs three times a day. I saw my nutritionist a couple weeks ago and she liked what she saw as far as what I was eating. I've added riding my exercise bike 30-35 minutes at night after 8:00pm. My endocrinologist suggest I try Trulicity, but after researching, the side effects were so negative I didn't start it. There were some people who didn't have side effects but the vast majority were vomiting and experiencing diarrhea, and it seemed really random when that would occur. So my doctor suggested trying taking one metformin in the morning and three at dinner. I didn't have any side effects but it didn't help my morning bs number and my day numbers were higher. So, I've gone back to 2 and 2. My morning bs is usually around 170-175. Should I try taking the 2 metformin at bedtime instead of dinner time? The exercising at night hasn't seemed to change anything either, but maybe I haven't given it enough time. Any suggestions?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "gal bladder", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Mine is being removed 9/20 as an outpatient. How many days after the procedure will I be able to resume regular activities? Thanks<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "What is a good glucose reading", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I'm afraid to use the pills my doctor has prescribed. I trying to manage my numbers with diet and exercise. I would like to know what is a good glucose reading? I'm currently testing 2 - 3 times a day.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "I think I might have Diabetes but I'm not certain. I'm scared to tell my family?", "tags": ["Symptoms"], "Type1": true, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Hello. I'm a 16 year old female and the last couple of days I haven't been feeling the best. However, I noticed that right before I started to feel this way I became particularly afraid of developing diabetes. It started off with slight numbness in my feet. At first I assumed it was only a placebo effect causing the sudden numbness. And then the numbness disappeared and it turned into a weird feeling in my calf, not a pins and needles sensation but just a strange feeling. Shortly after, I noticed that I started to feel generally unwell, like I had a bad cold. I noticed that I would get chills at random times. However, right before all of these symptoms started I just felt generally less hungry and I wasn't eating much, maybe about one meal a day. At first I assumed that perhaps it was caused by me not eating much.Then I noticed that I felt an increased need to urinate. I found that I felt the increased need the most when I was worrying about diabetes. However whenever I urinated only a little would come out and it usually had a strong scent of ammonia. Also I'll occasionally get these weird on and off feelings of being very drowsy. I noticed they usually occurred around 9 pm until usually midnight. I found it strange that eating usually made the fatigue go away temporarily. I would assume that eating would usually make it worst so this adds onto my doubts. The weird leg sensation has also been on and off as well and it usually goes away temporarily while I'm being physically active. If I now think about it, this illness has been kinda on and off. One minute I'll feel almost completely healthy then next minute I feel as if I didn't sleep at all the previous night. Also, I checked my weight and I haven't gain nor lost any at all. Also I've been feeling feverish so I assume it might be an infection that mimics the symptoms of diabetes. I've been feeling this way for about 4 days now. Right before this I felt perfectly healthy. I'm from a low income family so I kinda grew up eating crap and I still kinda do. I also usually do ingest a large amount of sugar and I have a family history of diabetes so I know I'm at a pretty high risk. I'm scared to tell my family because I don't want to burden them financially, and to be honest I'm terrified of needles! Before this, I've always been very healthy despite my eating habits and I've barely been ill in my entire life. I'm just kinda scared to accept the fact that I'm no longer healthy and that I'll probably never be able to eat anything sugary ever again. I've googled diabetic diets and it just seems so limited. I'm so angry at myself and I wish I could go back and change my habits. Does anyone have some advice? I'm so worried and scared. Not to mention my birthday is less than a month away and I want to be able to eat birthday sweets. And in case you're wondering, I'm at a pretty healthy weight and I'm not fat or obese.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Confused", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 4, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I've been a T2D for over two years. Decided to go a different route and take care of my problem myself. To make this as short as possible let me explain what happen. My question is why did this happen and can I get back on track. I went on a program which was to cleanse the liver first. To spare you all the details and keep this short the program was very successful. I lost 15 lbs in 2 weeks. In 60 days I was no longer on Metforin. A1C went from 10.3 to 7.0. with daily numbers of, fasting below 100...then after eating below 123 average. Was to continue down this path for 90 days for which then I would be allowed to slowly add cards and sugar back into my diet. Here's my problem. All of sudden out of the blue without any changes to the foods that I have been eating now and on the home stretch of only 30 days left on the program my numbers shot back up to T2D status and they are not coming down in spite of still during the same things from the start. What's happening ? Supplement that I'm taking is called Sugar Balance.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "trying to make the best of dealing with neuropathy", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I have a friend who has type 2 diabetes.....he also suffers from neuropathy, and has difficulty walking without a cane... if one is strict about eating healthily, is it possible to stop the negative consequences of neuropathy....knowing that one cannot cure it....thanks, ted<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Why is my blood sugar high in the morning?", "tags": ["Living With"], "Type1": true, "Type2": true, "numberOfReplies": 3, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    My blood sugar is consistently high in the mornings. Not off the charts but high enough that I'm not exactly comfortable with it. I have an appointment coming up with my doctor next month and I plan on bringing it up with her then, but I just wanted to see what people here might think. Anyone else experience this? Should I be changing something about my night time habits? I don't eat late dinners and I try to do something active after I do eat because I read that can help. I also eat something light fairly soon after waking up. Should I be eating a snack before bed? Do I need to make changes to how much insulin at night?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Exercise and Blood Sugar", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    How long does it take for exercise to impact blood sugar levels?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "high triglycerides (and other things), but normal fasting glucose", "tags": ["Type 2 Diabetes", "Symptoms"], "Type1": false, "Type2": true, "numberOfReplies": 4, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    My husband has a lot of health stuff going on - high cholesterol, high triglycerides, high blood pressure, obesity, sleep apnea - but his fasting blood sugar (via intravenous blood draws, not finger pricks) has always been in a healthy range (most recently 80 in March, 67 in April).However, his doctor yesterday basically told him he was prediabetic and noted \"IMPAIRED FASTING BLOOD SUGAR\" in his chart, even though he's never had an elevated fasting blood sugar level.So basically he has all the hallmarks of metabolic syndrome (which we knew) but without the high blood sugar. Healthy changes are clearly in order and will be happening, but I had at least been somewhat reassured (maybe silly, I know) by the fact that his blood sugar was in range. Is this really considered prediabetic? Or is he just at risk? Would love to hear what others think.Thank you!<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Blood Sugars", "tags": ["Insulin"], "Type1": true, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Why is my blood sugar higher in the morning and lower in the late afternoon. I take Metformin 1000 mg a day along with 2 cinnamon capsules 2 times a day.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Insulin Resistance and Alzheimer's", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Preventing Alzheimer’s Disease Is Easier Than You ThinkScience shines new light on root cause of memory problems.Posted Sep 07, 2016  How many of you, out there, understand the link between Obesity, Type 2 Diabetes and Alzheimer's?Excerpts from article, above...\"...The more insulin levels rise, the more insulin resistant cells become. Over time, this vicious cycle can lead to persistently elevated blood glucose levels, or type 2 diabetes...\"\"...the level of glucose in the cerebrospinal fluid surrounding your brain is always about 60% as high as the level of glucose in your bloodstream—even if you have insulin resistance—so, the higher your blood sugar, the higher your brain sugar...\"\"...While most brain cells don’t require insulin in order to absorb glucose, they do require insulin in order to process glucose. Cells must have access to adequate insulin or they can’t transform glucose into the vital cellular components and energy they need to thrive. Despite swimming in a sea of glucose, brain cells in people with insulin resistance literally begin starving to death...\"\"...Which brain cells go first? The hippocampus is the brain's memory center. Hippocampal cells require so much energy to do their important work that they often need extra boosts of glucose. While insulin is not required to let a normal amount of glucose into the hippocampus, these special glucose surges do require insulin, making the hippocampus particularly sensitive to insulin deficits. This explains why declining memory is one of the earliest signs of Alzheimer’s, despite the fact that Alzheimer’s Disease eventually destroys the whole brain...\"Inflammation is a direct cause of insulin resistance. Insulin resistance is a direct cause of Type 2 Diabetes. And, now, they've connected the dots between Alzheimer's and insulin resistance. The test for insulin resistance is the measurement of fasting blood glucose, A1C and insulin levels.Insulin resistance is treated by \"lifestyle modifications\" and in some (most) cases, \"medications\".If the treatment of insulin resistance is through \"LIFESTYLE MODIFICATIONS\", and, it has been ridiculously well established, now, how utterly vital it is to NOT TO BE INSULIN RESISTANT... then, why be vague about the treatment of INSULIN RESISTANCE? Why doesn't the medical profession spell it out for everyone, when your doctor talks about \"Lifestyle Modifications\"? Don't you think it's a wee bit odd, every single post, here, ends with the question, \"Should I be worried...?\" They are worried because they are CLUELESS. They are worried because they have no idea how to properly treat Type 2 Diabetes (aka, insulin resistance)...The truth is, nobody knows what \"insulin resistance\" is because nobody cares! But, when your lower legs and feet feel like they're on \"fire\", when you start to lose sight in an eye and, worst but not least, when you accuse your spouse of hiding your car keys or glasses, that's the time we should learn about \"insulin resistance\"? Obamacare or Trumpcare; what difference does it make? No insurance can possibly \"cover\" what insulin resistance does to the human body. Not one word in any medical insurance coverage addresses the prevention of \"insulin resistance\". And, the treatment of insulin resistance, now, represents 8% of our entire Gross National Product! Gee, if we could understand what \"lifestyle modifications\" meant, what could we do with almost a trillion dollars? If any disease \"progresses\", that means it getting WORSE. If you're doctor is having to increase the dosage of drugs, prescribed, that means it's getting worse. Of course, it's every patient's \"fault\" their disease is \"worsening\". They're the ones not following \"instructions\". They're the ones, not losing weight! We are know, patients are \"weak\" and without \"discipline\"...So, why be vague? If the treatment for insulin resistance is \"Lifestyle Modifications\", why not spell it out like we're 5 year olds? Why must people be \"worried\" about Type 2 Diabetes?Answer: Because. Nobody cares enough (to demand the madness stop).On your next doctor appointment, tell your doctor, \"I don't want to be Type 2 Diabetic, anymore. Tell me what I need to do to \"reverse\" my diabetes.\"Just do it!<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Metformin and Lipitor", "tags": ["Type 1 Diabetes"], "Type1": true, "Type2": false, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    My liver enzymes are climbing higher and higher. Would either of the above meds cause this rise? Been taking the Lipitor for overy 2 years and Metformin for about 6 months, slowly increased dose.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "I am worried I may have diabetes! Help?", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 3, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Hi, to begin with I am a male about 195 lbs and 6'2\" so not really overweight (pretty fit in general), but I've noticed some tingling in my feet and calves, as well as a little in my hands and face. I do not know if the foot pain is because I walk about 2 miles a day during school, but it's possible.About six weeks ago I went and got bloodwork done and received the following results from a fasting bloodtest:Cholesterol: 144HDL (High density lipoprotein): 79Glucose: 103HA1C: 5.30I eat like ***, have high blood pressure (nearly hypertension) from anxiety, and I probably drink too much.With these symptoms in mind, should I be concerned about currently having diabetes?Thanks!<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Psychosis as symptom of diabetes?", "tags": ["Symptoms"], "Type1": true, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I know a long term diabetic (he has already gone blind) who has paranoid hallucinations and delusions. But he knows they are not real because he usually won't admit to them when talking to doctors. Or if he does mention it, emergency medicine docs dismiss it as a side effect or a consequence of his diabetes. But this is a long standing problem. It seems to happen without being related to his sugar levels. And I've just never heard of these complex long-running (years) paranoid delusions being related to diabetes. He is 49 years old and on an insulin pump. He won't get psychiatric help because neither he nor his family \"believe\" in mental illness.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "A1C", "tags": ["Insulin", "Diet", "Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    How do you get your a1c down mine is 13.2 I have never been able to get it below 11 what am I doing wrong I eat right and I take 2 different type of insulins I don't over eat<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "High Fasting Numbers", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 3, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I have had high fasting numbers for a couple of years.My numbers are high when I test and when I have blood work done.My numbers are always 130 and higher.Some mornings when I test the numbers are in the 140's.My A1C last month was 6.2.My doctor doesn't really seem concerned.Tells me to eat better and lose weight.My numbers do go up over 200 when I eat certain foods.Should I be concerned about this and is my doctor doing enough? Thanks Ann<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "question about diabetes and dementia", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I recently heard that diabetes can cause dementia. Since I've had diabetes for about 25 years and I'm now in my 70's I was wondering if it's true.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "News: Diabetes Drug Gets FDA Warning", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    \"The type 2 diabetes prescription drug canagliflozin (brand names Invokana, Invokamet, Invokamet XR) appears to increase the risk of leg and foot amputations, the U.S. Food and Drug Administration says.The FDA is requiring the medications to carry new warnings about the risk. The required warnings on the drug's labeling include the most serious and prominent boxed warning.\"You can read more here: <BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "how I lost weight and improved my diabetes", "tags": ["Exercise", "Insulin", "Treatments", "Diet", "Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I will try to keep this as simple as it is. I am a 73 yr old, 20 year diabetic.When I finally retired and was able to eat what I wanted to, I lost weight and my blood sugar readings dropped and stayed low. I eat good foods. I buy blueberries and other 'healthy' foods. When I get hunger or 'tasty', I simply eat something good from my pantry. Since I like all the things I buy (for the most part), My hunger is satisfied. When I go out, I eat basically anything I want; although most of what I choose is good for me.Now, having done this for awhile, I am 40+ pounds lighter, my AIC in the 6.3area.What I am trying to say is that by surrounding myself with quality good foods and eating foods FOR the goodness they contain, I have brought my diabetes in check. For breakfast today I'll have oatmeal with blueberries and raisins. Later, I'll eat a small tomato and two apricots (the tomato because I know it is good and the apricots before they go bad). I brought an avocato because of it's good fat, I''ll eat it later or tomorrow for sure. Simply put I buy and eat foods that are listed as good for diabetics and then eat them because I need the nutrients. I may grab a few dates and a tomato.Later I will eat celery and peanut butter. Later still I will take my delicious $5loaf of 9 grain and make a sandwich of chicken with loads of veggies.When I go out, I basically eat anything I want; very seldom is it a hot greasy cheeseburger.I only buy nutrious things. No chips, no soft drinks, rarely ice cream, good choices of meat (the -loins, etc. and not much), only healthy cereals, always guided by nutritious values.My diet is a way of life for me. I am aware that I choose the things I eat for health reasons not necessarily taste. But the truth is there are many things that are good for you and filling yourself with what you should eat is easier than you imagine. Try it, for the next week eat only 'good stuff'. Two eggs and great bread with juice. Later eat a raw tomato and some grapes. Keep eating good stuff all week- force yourself. If you can focus on the nutrientswhen you shop, it follows that you will eat them if available. Soon this will be the way you eat. It is a small difference, but it could change your life.You will learn to eat many small items over the day and rarely overeat.Simply put, By filling your shelves with 'good' foods and forcing yourself to eat them, you'll just naturally become slim and healthy, diabetic or not.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Rising blood sugar", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 3, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I used to be able to keep my blood sugar level down to the low 100s or lower, but now I am struggling to keep it under 120. All I take is supplements and watch my diet. Any advice on getting and keeping it down?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "What is considered \"high risk\" blood sugar levels?", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    My mother was recently diagnosed with type 2 diabetes. Her blood sugar levels are always above 400 and never drops more than that. We have called the hospital to seek guidance and they adviced her to go to the ER. When she gets there the doctors that saw her told her that she shouldn't go to the ER because it is not an emergency. She was diagnosed two days ago and has appointments scheduled next week for it. We are not well educated in diabetes, so all that we know is what is posted on the internet. Any help would be appreciated.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Glucose levels for someone 70 years old", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 4, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    My Doctor has told me I should not worry about higher sugar levels at my age. He said I should keep them above 100 at all times, so I do not fall and break a bone. This makes no sense to me, and seems rather condescending. Is there any reason why I should not try to maintain blood sugar levels in a healthy range of 90-100 after fasting, and after exercising?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Old Folks", "tags": ["Diet", "Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I'd love to be able to receive Web MD posts especially for old folks. I get several, one so I can help my wife. But I'm getting close to my 8th decade & would love to be able to read things specific for old folks. I most definitely, am in my Ecclesiastes 12 \"Difficult Days\". Fearful of heights because of Diabetic neuropathy in feet & above my knees, I lost my ability to stand without something holding me up, a long time ago. Eccl 12 on \"grinders\" well I have false teeth. \"clouds\" a certain amount of depression because I can no longer do simple things, need to hire them done (even changing a light bulb), to look up, would cause me to get dizzy and fall. so the result is \"rain\", tears. Insulin doesn't work for me. All I can do for for exercise is use my Medi-Massager for my feet & legs. Very painful knees & legs. I am very blessed to have a virtuous wife as Proverbs 31:10-31.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diet & Diabetes", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I have been experimenting with various food supplements and my blood sugar dropped dramatically. Coincidentally, I have been taking chlorophyll in my water. Has anyone had success with blood sugar loss with taking chlorophyll?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Should I be concerned", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I was gestational diabetic for 2 of 3 pregnancies. I failed to be rechecked after my 3rd. I noticed I have been feeling a little off at times so I decided to check my blood sugar 2 hours after I ate and it was 166. Should I be concerned?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "supplement", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Diazapole for diabetes II<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "The Secret Disease", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Dehydration...For a country that is drowning in fresh, clean drinking water, such a large percentage of the population doesn't drink enough of it.At least 50% of the doctor visits for women end with the physician reminding the patient to drink more (freakin') water. Infections, constipation, muscle & joint pain, headaches, severe menstrual cramps, gout, insomnia, skin disorders, gum disease, chronic fatigue and, of course, Type Diabetes can be exacerbated by lack of fluid in-take.You can eat the healthiest diet in the world & exercise for hours...it will be all for nothing without enough water. The countries with the least amount of available fresh drinking water suffer the greatest health threats. Lack of water is the most insidious and destructive form of malnutrition.People come to this board complaining of chronic, unrelenting symptoms. They've tried \"everything\". Everything, that is, except drink more water! 75% of seniors over the age of 65 suffer from dehydration. Billions could be saved...BILLIONS!!!!!!!!!!!...if these people could simply drink more water. It's absolutely pathetic! If a medical equipment manufacturer could design a simple & easy device allowing seniors to receive intravenous fluid replenishment while watching Judge Judy, every afternoon, we could cut our taxes a huge amount. We seldom miss \"Happy Hour\" and, never, our morning Starbucks. But, we can't remind ourselves to drink a cup of water every couple hours. In truth, one of the hardest things to do, is drink more water. My daughter is a health professional. We spent a lot of money to put her through college and graduate school. She eats very healthy and walks 5 miles, everyday. She has less than 18% bodyfat. Yet, she doesn't drink enough of water! She's only 26 and suffering health issues you wouldn't believe...and, there's little I can do to help her because she can't establish the habit of drinking water throughout her day.PS: Every individual with Type 2 Diabetes, you could be suffering entirely unnecessarily. This is why I always say, each person is different, each case is different and people can't seem to get this through their thick skulls. The \"kicker\" is water consumption...at minimum, 64 to 72 oz! If you aren't drinking that much a day, you will continue to have problems no matter what you do. It's hard to drink more if you're not thirsty. I needed to drink more water to reverse my diabetes. It's hard, I know, but \"it is, what it is...\"<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Should I be concerned?", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I am an older male and a patient of a doctor with a very busy practice. Recently, my lab (blood) results came back with the result of GLUCOSE at 61 and HEMOGLOBIN A1c at 6.7.My research shows that I am possible Diabetic or Pre-Diabetic, yet my doctor seemingly is not concerned: no phone calls, no prescription, nada. I sent a message on his \"Patient Portal\" asking: \"I note that my glucose value is at a new high of 161 (from a previous level of 135 in September 2016) although my A1C remains at 6.7. Please know that blood was given after a true and honest 12 hour fast ... absolutely no food or fluids. Should Metformin be considered?\" This was their response: \"It is on the portal already. It is part of the BMP and Glucose was 161.\" Hmmm ... not only does it seem that they did not read my question but neither do they seem to be bothered by the number itself. I currently do not take any medication for this condition, nor have I been \"diagnosed.\" This is a case of me, the patient, doing research on my own and (trying to) ask questions of my doctor.Should I be concerned even though it seems that he is not?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "May I Suggest This To Reverse Your Diabetes:  Fasting", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 4, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    How many supplements have you read about that supposedly \"cures\" diabetes? How many diets? How are those drugs your doctor's prescribed for your diabetes; How's that working for you?Here's my suggestion that I know will work: FastingWhy does it work? Because, when you stop eating, your blood sugar levels not only decrease, your INSULIN levels decrease, too. So, why is that such a big deal? Because, insulin is the \"Fat Storage Hormone\". Insulin clears the bloodstream of blood sugar and places it in the liver (glycogen) and any excess glucose, in lipid cells as fat. The reason why bariatric surgery reverses Type 2 Diabetes well BEFORE you actually lose all the weight (in some cases, days after surgery)? You're not eating, anymore! You stomach has been stapled shut to the size of a walnut! Far less insulin is being produced and now your body can deplete glycogen stores in the liver and, then, go after the stored fat. Once excess bodyfat begins to be used as energy (in lieu, of food), blood sugar levels begin to stabilize almost immediately.Is fasting bad for you? Google it; Don't make me do all the work for you! Do you lose muscle when you fast? No. Does your metabolism slow during fasting? Not unless you decide to sleep in a cave for the next three months, no food. Is fasting expensive? Only for morons, it is. Are there rules for fasting? None that I know of? Should I fast without telling my doctor? Only if you know absolutely nothing about Diabetes or have difficulty making a phone call without assistance. The bottomline: If you lose weight, your Type 2 Diabetes will improve. If you stop eating, you will lose weight. 2+2=4 If you stop eating, your Type 2 Diabetes will improve. Fasting reduces insulin resistance...PERIOD!  PS: I just think it's very odd that nobody, out there, has responded to my posts, of late. All of them (posts) is centered around the same central theme: What if the treatment of Type 2 Diabetes has nothing to do with HIGH BLOOD SUGAR and everything to do with reducing INFLAMMATION & INSULIN RESISTANCE? Ie. What if the treatment of Type 2 Diabetes was LOWERING insulin levels, not raising them (which most diabetes medications are designed to do)?Then, that would mean, all these millions and millions of people who've been taking pills to \"artificially\" lower high blood sugar were actually doing nothing to stop the \"progression\" of Type 2 Diabetes. Then, that would mean, that they're symptoms would worsen over time despite making every effort (thru diet, exercise, stress management, etc) to keep them at bay. Then, that would mean, as taxpayers, we're paying billions of dollars in faux treatment protocols, that simply just don't work. In fact, the population in the US is getting fatter and more diabetic......and, who would receive all this trillions in money, either directly or indirectly, designed to treat Type 2 Diabetes? Medicine and Pharmaceuticals, that's who.We have a doctor, here, now. Not one word. Nobody, not one word in defense of present day treatment of Type 2 Diabetes? Say, \"Bahhhhhhhhhh\". Like my dad use to say, \"Don't cry about it; Do \"something\"! That's why its so \"odd\" and \"eerie\", this board. It's like the \"zombie apocalypse\". Everybody is just passing time and willing to accept whatever \"horrors\" come their way, I guess.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Body odor.", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Just a question. I don't have diabetes that I'm aware of. Last blood work was ok. But in last couple weeks I have noticed a odor coming from my hands and arms. It actually smells like diesel fuel. I am a truck driver and do haul diesel and gas but it's not from any spills. I take a HOT shower and scrub with soap and 5 minutes after shower I can smell it from my arms and hands and even my sweat. Any ideas from anyone??? Do have a Dr appt coming up but wanted to see if any Dr or anybody has ever heard of this. Thanks.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Type 2 is the most common form of diabetes", "tags": ["Treatments", "Type 2 Diabetes", "Symptoms"], "Type1": false, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Type 2 is the most common form of diabetes, accounting for more than 90% of all cases of diabetes.The number of adults diagnosed with diabetes in the United States has risen significantly over the past 30 years, from 5.5 million, almost doubling to $ 21.3 million in 1980Type 2 diabetes has been known as adult onset diabetes and non-insulin dependent diabetes mellitus (NIDDM), but the disease can occur at any age and increasingly includes childhood.What is type 2 diabetes?Type 2 diabetes is most common in adulthood and occurs in overweight and physically inactive people.Unlike the currently unavoidable type 1 diabetes, many of the risk factors for type 2 diabetes can be modified. Therefore, for many people, this can be prevented.The International Diabetes Foundation highlights four symptoms that indicate the need for a diabetes test:Frequent urinationlose weightLack of energyExcessive thirstyFor more information, visit the Knowledge Center article on symptoms or diagnoses.Type 2 diabetes causesInsulin resistance is usually a precursor to type 2 diabetes - glucose enters cells that require more insulin than usual insulin. Insulin resistance in the liver leads to more glucose production, whereas the resistance of the peripheral tissue means that glucose uptake is impaired.Obese male abdomen.Obesity can lead to insulin resistance - usually a precursor to the development of type 2 diabetes.Damage will stimulate the pancreas to produce more insulin, but the final pancreas can not be enough to prevent blood sugar levels rise too high.Genetics plays an important role in type 2 diabetes - the relatives of people with the disease are at a high risk, especially among the American Indians, Hispanic and Asian populations.Obesity and weight gain are important factors that lead to insulin resistance and type 2 diabetes, which play an important role in genetics, eating habits, exercise and lifestyle. The effect of body fat on insulin and glucose metabolism is hormonal.Once the type 2 diabetes is identified, health care providers can help patients receive education and monitoring programs, including how to detect signs of hypoglycemia, hyperglycemia, and other complications of diabetes.As with other forms of diabetes, nutrition and physical activity and exercise are important factors in lifestyle management.For more information on how to compare type 1 and type 2 diabetes, please read our article: Differences between Type 1 and Type 2 Diabetes.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "muscle cramps", "tags": ["Exercise", "Diet", "Oral Care", "Type 2 Diabetes", "Symptoms"], "Type1": false, "Type2": true, "numberOfReplies": 4, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Dr. I have been a diabetic type 2 for about 20 years and my most recxent A1C was 7.1. I exercise every day and my blood sugar readings for the past 3 months average out to 120. My question is--lately I have been getting muscle cramps in my legs. Are they a bi-product of diabetes? Thank you Jim Artese<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Nursing home caused the death of my mother after only 4 days", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    My mother had type 2 diabetes controlled by medication for about 30 years. I was caring for her for about 20 years but it was getting difficult and I am older now. I admitted her to a nursing home on June 14 and we, her family, called 911 on June 19 because she was not herself, she was sleeping too much, not responsive. My mother always took her meds and checked her blood sugar. If it seemed high, around 180, then she made sure to make extreme adjustments. We have since found out that her BG went up to 428 and they are claiming that she refused to take her meds. I believe she wasn't alert enough to make that decision because she was going into diabetic coma. She passed away on June 19 from STEMI ecg, internal bleeding. What is your opinion? I don't recall her BG getting above 200 at home (her machine records). I picked up her medical records and there is a note where it was \"missed\" to give her insulin when it was first noticed that here BG was in the 400s. I was trying to get better care for my mother by putting her in the nursing home and now the guilt that I will have to live with for the rest of my life will be unbearable. I counted on them to be the professionals, to do right by her, and to give her the right care that I did not think I could give her anymore at home.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "3 supplements", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Dear Dr. Nazario:I would like to thank you for offering your highly valuable expertise to help us.I have type II diabetes, and I take green algae, bromelain, and&nbsp;pterostilbene.The directions say \"take with an empty stomach\"; I need to know the following:1. How long does the worst meal take to leave? And2. How long do I need to wait after taking the above supplements before I can eat?Thank you.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Type 1 diabetic that's always in dka", "tags": ["Insulin", "Type 1 Diabetes"], "Type1": true, "Type2": false, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I go thru the same thing they call me a brittle diabetic I can barely eat something any sugar goes crazy I'm constantly in the hospital for dka an they say mismanaged diabetes when I manage my diabetes it's not fault I'm tired of getting treated like it's me when I'm in the hospital on a insulin drip an my sugar does the same thing an they can't control it an send u home an u get sick an home an go bk into dka I jus want a resolution im sick of this I want to be normal some what but it's hard when they sent understand or know how to fix the problem<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "How is A1C levels determined?", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 6, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I do not fully understand how my Dr. determines my A1C. When I was checking my blood sugar every morning I was under 120 most of the time. Sometimes it would spike, but rarely did my test meter show over 129. I do understand that 80-120 is normal, but if that is the case why would my A1C be 7.2? Now he wants me to test my blood sugar 2 hours after supper. I have been doing this now for about two weeks and, although I came pretty close, I have not gone over 180. According to the information that he gave me, anything below 180 is good. Is there a special test that my Dr. performs or is there a formula used to determine A1C?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Blood Sugar Averages", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 9, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    My blood sugar monitor shows me that my 30 day average was 175.Should I be concerned? I tested most everyday before breakfast and 1 to 2 hours after. Thanks for your help.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Latest Study on Moderate Alcohol Consumption :)", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    \"Moderate drinking may alter brain, study says\"( ) Are we pretty much in agreement about smoking? I see plenty of people still smoking in public, to this day. When you see a \"smoker\", now, what goes through your mind? What sort of \"judgments\" do you make about people who choose to smoke cigarettes...especially, in public? I smoked for almost 30 years and I can honestly say, in 2017, I have very little compassion and respect...because, it's common knowledge: cigarettes shorten lives. With that said , let's discuss alcohol for a moment... It is clearly well accepted that \"excessive\" consumption of alcohol is \"bad\". Not only is it bad from a health perspective, but from a social perspective, alcohol clearly plays a pivotal role in a large percentage of abusive, violent and criminal events we routinely observe in daily life. As a parent sending your kids away to college, what's the first things you warn them about living away from home for the first time? If it's not about the dangers of off-campus alcohol and drug abuse, I can honestly say, you're either, A. naive, B. in denial, C. an imbecile, or D. an alcoholic (like I use to be), yourself. But, what I found to be most interesting (or, \"suspect\") were studies that \"proved\" that \"moderate\" alcohol consumption was good for you. That it was, in fact, \"healthy\". Now, how itf can something bad for your health, in large amounts, be good for you, in \"moderation\". lol Kinda like like eating poison mushrooms or produce with pesticides, how can eating a little bit, not only be OK, but actually good nutrition? Intuitively, that's a tough nut to crack, right? And, now, decades after the first studies about those self-righteous \"Mediterraneans\" :)...the experts are beginning to reverse course. Maybe, what's bad for you in large amounts, may actually be bad for you in small amounts, too. But, don't worry, just, yet. For all the \"social\" drinkers, out there, reading this, take heart! My guess, is there'll be plenty of \"rebuttal\"studies, forthcoming, soon. Take comfort in knowing the beer, wine and spirits guys will not go quietly in the night! Distillers are not going to knuckle under to public pressure like the cigarette and soda folks, before them. When it comes to protecting \"turf\", these dudes are tougher, more ruthless than the NRA. So, drink up and tell yourself its \"good\" for your diabetes...at least for a while longer.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "A1c", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    What is the normal range for an a1c level.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Bright Line eating diet", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    This diet is No flour or sugar. Weigh and measure your foods. No snack or eating between meals.. I dumped about 20 lbs of water and have been losing small amounts on a steady basis. I just wondered if you have heard of it and your opinion of this plan.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "DIABETES", "tags": ["Diet", "Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Can you tell me how to find a food list of things I can and can not eat with diabetes type 2.I have not taken this as seriously as I should but I want to make some life changes.My current medicine is Metformin<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "What could possibly be wrong with my friend? Diabetes? Heart disease? Kidney failure?", "tags": ["Type 2 Diabetes", "Symptoms"], "Type1": false, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    She is 50 years old. These are the symptoms she has experienced over this past year, some of which I have seen first hand others she has only complained about. All symptoms seem to come and go. Just when I think she has to go to a dr the symptom will go away and she will have an excuse for it. Here is what has been going on for a year:Heartburn (takes several different antacids daily) starting to complain that they need to be stronger because they're not working as well.Hot flashes Cold sweatsBouts of nausea Has had pains in back, neck, arms, jaw, teeth, knees, feet (sometimes in combo with sweats and nausea, but eventually it goes away)Itchy skin ( extremely dry itchy scalp, red itchy spots on upper arms, peeling hands)White spots in throat, difficulty swallowing ( gone in one week)Restlessness (complains of inability to sleep) Episodes of heart racing (especially at night, but goes away) Has had headaches daily for at least a month strait ( must be dull because she was still able to function) that symptom seems to have gone away since the weather has gotten warmer. Her hands and feet seemed to get colder than normal during winter months (almost painful)Has complained once of foamy urineOne ankle swells occasionallyWatery eyes, feeling like stye (went away)Tired and yawns a lot during day ( but she is still out and about)Hardly ever urinates (despite drinking a large coffee daily)That's it in a nutshell.. just when I think she will have to go to the dr her symptoms go away and she's fine for a few days until the next time she complains. She is at least 100 lb overweight mostly belly and neck fat. I'd like to hear what you think might be going on inside her body, no one in her family seems to care or insist she see a dr. I feel like I would be overstepping my boundaries.. I'm confused.. help<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "News: Nasal Powder Could Fix Severe Low Blood Sugar", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Low blood sugar levels are a serious health risk, but researchers report that a new nasal powder quickly reverses the effects of this dangerous condition. And better yet, it can be administered even when someone is unconscious.You can read more about the nasal powder and how it works, here:  What are your thoughts?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "out of control a1c", "tags": ["Type 1 Diabetes"], "Type1": true, "Type2": false, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    My doctor says I am a miracle..He can't figure me out..I am type 1 and my a1c since 2001 has never been under 10..My bloodwork comes out perfect, my kidneys are perfect and my weight is always under 122..I have pretty good readings but have a lot of highs and lows..I eat healthy and get in my pool every day..winter months here in florida don't last long but I have an exercise machine during that time..Why is my a1c so high?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "I've eaten a lot of brown rice since my last blood test, which was 3 months ago. My A1C was 5.7. I didn't know that rice was bad for blood sugar. Will this hurt me, if yes, how much will it hurt?", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I've eaten a lot of brown rice since my last blood test, which was 3 months ago. My A1C was 5.7. I didn't know that rice was bad for blood sugar. Will this hurt me, if yes, how much will it hurt?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diabetic to wound", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I am an over 50 diabetic female with an accidentally self inflicted wound on my big toe. I was trying to give myself a pre-summer pedicure and while trimming the thick nail and the heavy callus underneath the nail, I cut a little too deep and cut through the skin. My doctor treated the wound by trimming away the excess skin and applying antibiotic ointment and covering it with a piece of tube gauze. I am not having any luck keeping a bandage on the toe, so my doctor recommended that I could just keep it clean with soap and water and wear clean cotton socks. I would like to know if it would be a good idea to soak my feet in a solution of epsom salts or if that would not be a good idea. I also purchased a pro-foot vita-gel toe protector, but when I got home, I noticed that it is not recommended for use by diabetics. If I do end up using it, would it make a difference whether I applied antibiotic ointment, or would antibiotic cream be a better idea? Any and all help would be greatly welcomed and appreciated.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Blood glucose", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    What are normal blood glucose levels?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Blood Glucose levels", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    What is considered a normal fasting blood glucose<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Gangrene In Diabetes", "tags": ["Type 2 Diabetes", "Symptoms"], "Type1": false, "Type2": true, "numberOfReplies": 3, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    My brother has Type 2 Diabetes and he recently found out he had gangrene in his toe and changing dressing there was a foul odor that kept getting worse what should be done?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diabzole", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Wanting to know if is any good for you.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diabetic food problems", "tags": ["Diet", "Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I am an older woman who has lost all her teeth and the bones that support dentures or implants are gone also. So all I am able to eat are very soft foods like eggs, pasta, oatmeal, bread with no crusts, and the like. Many foods I have tried like chicken or rice have choked me. I am also T2 Diabetic and I don't know what to eat anymore. I'm sick to death of my meager food choices. What do I do?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "\"...&, Eat More Fruits and Vegetables\"", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    E.M.F.V. (aka Eat More Fruits and Vegetables)...Every diabetic has heard their doctor say these words. They say it at the end of every appointment. They say it, like it's as easy as, \"Don't leave the house without your cell phone\", or, \"Don't forget to brush your teeth twice a day\". But, anybody can brush their teeth twice a day. Very few, though, can \"eat more fruits and vegetables\". Why? Because,1. Process foods are easy. Hand over the money, toss it in the microwave. You'll be eating in less than a few minutes.2. Process foods are tasty. It's loaded with sugar and salt, the most subliminally addictive \"legal\" compounds in the world. Do you think manufacturers don't know this? 3. Process foods don't spoil. No need to throw away processed food because it's got \"preservatives\" (some people actually think this is a \"good\" thing!). 4. Process foods are cheap. Pancake mix? Cheap!. Crackers? Cheap! White bread? Cheap! Tortillas? Cheap! Pasta? What's cheaper than pasta? How easy do you think it is to \"Eat More Fruits and Vegetables\" when most are not nearly as easy, tasty, can spoil in hours instead of months, and expensive (because it's got to \"cooked\" within a recipe that contains 9 other ingredients)? But, the biggest obstacle to \"E.M.F.V.\"? You have to actually perform WORK. Generally speaking, when you \"E.M.F.V.\", you have to shop, prepare, cook and clean up after each meal. In other words, it's a lot of work! A member said to me the other day, \"the reality is, most diabetics are just not capable of reversing Type 2 Diabetes...\" The sad truth is, he's right. People are \"too busy\". They have too many \"obligations\". They have too many \"mouths to feed\" and \"bills to pay\". They have too many trips to make and events to plan. They have to go back to school. They have to look for work. They have to buy a new car. They have to take care of their mom. They have to take their dog to the vet. Their kid was arrested for D.U.I.. They got arrested for D.U.I...yada, yada, yada. How can you eat more fruits and vegetables and still have time to live your life? So, when somebody posts a question about diabetes \"diets\" and \"diabetes friendly foods\" to recommend, just remember \"E.M.F.V.\". Unless you live in a cave, everybody, by now, has heard about the absolute critical importance \"Eat More Fruits and Vegetables\" has in treating Type 2 Diabetes. They already know what to eat. That's not the problem. What they're really asking is, what real foods can I eat that don't require any work, whatsoever, and are, of course, easy, tasty, fast and cheap? Sadly, if all fruits and vegetables were easy, tasty, fast and cheap, there would be no disease in the world. If you want to be free of Type 2 Diabetes, you have to pay the price.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Type 2 diabetes and methadone withdrawal", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 6, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Hi, I was diagnosed with type 2 diabetes around 7 yrs ago. I take both oral medication along with insulin injections. My sugars still arent controlled and still are way to high. I have also been in the methadone clinic for about 4 yrs now. Before that I was a patient at a local pain clinic where my addiction was started and was there forabout 6 1/2 yrs. It is along time to be on methadone. Almost 2 weeks ago my husband was in a car accident which left him with 2 breaks in his wrist. Unfortunately this has put him out of work which means we cannot afford to continue to go to the clinic. Starting Monday we both will start being financially detoxed which means that we will decrease our doses at a rate of 5 milligrams a day. I am scared of the detox part alone but wonder if anyone can tell me how this will affect my diabetes and if I may be in any sort of physical danger because of the diabetes? If anyone out there can help me to know if this is something I should really be concerned about? I have been told that I need to go through a medical detox but not only is there none around me that do medical detoxes but I couldnt afford it even if they did. I am very scared and desperately need some advise. Please and thank you<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Second opinion on blood test results", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 3, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Results of my blood test:Total cholesterol: 169ml/dLLDL cholesterol: 109mg/dLHGB A1c: 5.3%My doctor says I have high cholesterol and wants me to take atorvastatin as he says I have diabetes and need to control my cholesterol. He says he is supposed to offer me these per medical guidelines. Reading articles on cholesterol and diabetes, my results look fine and I don't see a need to take any meds. Should I be looking for another doctor?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Age and A1c levels", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    My endocrinologist and PCP both told me that the ADA states the for an 80 year old T2 diabetic the normal A1c is 7.5. Has anybody looked into age and A1c levels?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diabetes", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I've been dealing with some symptoms and was told I could have diabetes but don't have a way to be tested for it. I constantly feel thirsty and use the restroom about 20 times a day. My hand and feet keep getting the numb feeling and my skin is really ichy checked my blood sugar this morning when I woke up and it was 103. I checked it two hours after eating breakfast it was 88 and then two hours after lunch it was 101.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "How many units", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    How many 20 unit doses in a bottle of Humalog U-100 10ml? I figure its 12.5 please let me know if this is correct. Thank you.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "High AM glucose", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Why is my BS 125-130 after fasting all night but is 110 2 hours after eating?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Insulin", "tags": ["Insulin", "Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    My Doctor has me using Novolog Flex Pen during lunch on a sliding scale. Does this need to be refrigerated after first use and can i leave it in my desk drawer and it will be okay?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Loosing weight taking Metformin", "tags": ["Exercise", "Diet", "Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 3, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I am in the \"pre-diabetic\" stage of the disease. I had been taking Metformin for 12 months, lost 40 lbs. and so my doctor agreed to let me take a natural supplement in stead of the Metformin. (Fenugreek). Now I have been taking the Fenugreek for over a month, and have started to add back the pounds I had lost. I have also increased my exercise 30 minutes daily. Can I get the same weight loss results with out taking the Metformin?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "TOLD I HAVE TYPE 2 DIABETIS", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    IS NUGENIX TESTOSTERONE BOOSTER BAD FOR TYPE 2 DIABETIS?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diarrhea after stopping Metformin with T2D", "tags": ["Oral Care", "Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I was diagnosed with T2D in May have been taking Metformin and Glicazide since then. A week ago diarrhea started and has gotten worse over time. Doctor suggested I quit Metformin for now and it should stop after a couple of days. It has become watery and bright yellow. Recent blood test indicate no signs of a bacterial infection. I am concerned as to how long this is going to last. Any suggestions would be appreciated<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diabetes", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    How does Type 2 Diabetes affect a person's mental state?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Sweating out red from drinking wine", "tags": ["Diet"], "Type1": true, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I recently, in the last 2 weeks decided to kick all liquor and beer consumption, instead opting for 1-3 glasses of red wine per day, consumed usually between 6-10pm. In this time, I have noticed starting with my clothes, a red tint, what I thought was dye from a red shirt I had, spreading over to furniture, then to several pairs of shorts and now other shirts. I really didn't want to believe it was me sweating out red wine, since all of my searches on Google came back with virtually no instances of this happening. But having now looked at my bed sheets and pillow cases, this is the only possible explanation. Can someone help me here? I don't feel irregular. But it has been very hot here in NYC in the time I've been drinking the wine. So we're sweating here more than usual.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Pancreatogenic diabetes", "tags": ["Living With"], "Type1": true, "Type2": true, "numberOfReplies": 3, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Hi I was just wondering if anyone else has or knows anything about type 3C also known as pancreatogenic diabetes. Most people have never even heard of it and I would like to find someone who knows about it or has it so I can compare notes maybe get advice something<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "diabetes", "tags": ["Exercise", "Insulin", "Treatments", "Diet", "Oral Care", "Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 3, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    My glucose levels are usually normal in the morning. Do I still need to take my insulin and pills?Or do I have breakfast and then wait a couple of hours?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "My A1c", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 7, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I have been type 2 diabetic since 1998. My glucose levels are fine but my A1c is going up. It is now at 9. I do not feel bad or have any problems with my meds or daily sugar levels. My doctor is also having trouble dealing with this. He is considering adding an insulin ( I already take Victoza 1.2 units morning and Toujeo 28 units at night), but has not done so yet. Any suggestions?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Guessing at this point", "tags": ["Type 1 Diabetes"], "Type1": true, "Type2": false, "numberOfReplies": 3, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Type 1 diabetic for 17 years. Medtronic insulin pump. Novolog insulin. Blood sugar been between 350 and 550 all weekend. Take correction dose in pump does nothing. Take it in syringe sugar comes down some but not like it should. Take more insulin then I need for correction and lowest I can get to is 350. Tried new bottle of insulin, changed pump site. Neither made a difference. Not sick, eat same as always, activity level same as always. Not sure if pump messing up, bad batch of insulin, or something else. Any suggestions?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "pre-diabetes", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    what is the normal glucose readings ?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Reading", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 9, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    My fasting readings in the morning are 165-175 and my A1C is 7.2. My endocrinologist thinks that at age 75 these readings are just fine. I worry that they seem high. I take 1000 mg of Metformin twice a day but nothing else. Any comments?Kruizer<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diabetic 2 female...ejaculation has funky smell", "tags": ["Living With", "Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 7, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Sorry but i have to find out whats going on.i take Metformin 2x a day, 500 mg i believe. my sugar is about 160 after i eat, not the greatest but not too off the wall.so my question is, when i ejaculate it has a smell, it doesnt smell like urine, its not horrendous but it does have a smell. is there any way of 'curbing' that smell? like drink more water, or juices, i never had that 'odor' before i found i was diabetic which was about 2 months ago.thanks, it really is keeping me from having sex...help please<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "diabetes", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 3, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I was told three years ago when I became seriously ill, that I was a type 2 diabetic. Several years later I was told my blood sugar is normal and everything looks great, yet I never changed anything, my diet, never exercised much and never took any type of medication. To me diabetes is a medical condition that affects people differently. While I was in the hospital I was told that I had to do this and change that but I didn't and now magically I have no more diabetes. I got tired of doctors saying you are fine, there's no problem and everything looks good so I just tell people diabetes is a temporary thing for me, I had it for the moment. If anybody says diabetes can't be reversed they are in denial or have come to accept the fact that this controllable reversible condition is uncontrollable and irreversible. Take it from me only type one is serious.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diabetes", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    My mom was recently diagnosed with diabetes. She is to check her sugar levels in the morning and in the evening. Her concern is that her number is higher in the morning (like 150) and lower in the evening (like 70 as low as 61). Should she be on concerned?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diabetes", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 9, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I have been diagnosed with both Type 2 Diabetes & Gout just 18 months ago. I am not on Insulin, diet and exercise are my treatment; lost a few pounds and my A1c has been in the normal range. I do need some guidance on exercise as when I return from walking/shopping I am exhausted and my feet burns especially in the thigh area.Are there no approved medication to reverse Diabetes? I receive so many emails on Reversing Diabetes and am a bit cautious to try any especially as the cost is exorbitant. At age 70 yrs old and I am really in need of guidance.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Metphormin", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    How bad is if some one is taking 4 metphormins a day and then runs out because he forgot to call in his prescription<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Type 2 diabetes", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Nothing to add.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diabetic", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    How bad is to be prescribed metphormins and told to take 4 a day. And then run out and not be able to take them<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Please help me im scared", "tags": ["Symptoms"], "Type1": true, "Type2": true, "numberOfReplies": 11, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Im so tired all the time. I barely have energy to walk. Go out. And even doing very little im so exhausted by 3-6pm i have to go to bed. Im yawning excessively. Im dizzy. I keep missimg work and im scared theyll fire me at this rate because i cant do my job properly any more. And im so so thirsty. Ive drank 8 litrrs of water. 3 in just one hour and im still thirsty. Im scared to drink more. I heard many people died and had less water than this before. The weird thing is blood results gfom doctor came back normal. Apparently blood sugars normal but it has been high before but not high enough to be diabetic. So im on metformin 500mg but lately my tiredness and thirst is so bad im drinking 10 litres of water daily.Peeing clear twice an hour or two hours. And i cant go to work. Since these sumptoms started i went to docs and they said normal. But the symptoms are getting worse. (8.5 but i hadnt eaten anything in 12 hours)I keep geting a sharp pain in my head and it feels tight and i feel nauseous and i hope its me being a hypocondriac but im so tempted to drink even more water. I just dont understand how they dont see me as diabetic but its effecting my every day life. Even my co workers mention how much i drink.I dont eat a lot of sugar but i only revently discovered all carbs turn to glucose and i do eat a lot of carbs. Bread. Pasta. Potatoes. My head feels so swollen. Ive kever drank this much water so quickly but as soon as that water touched my lips i had to down it i just felt like i hadnt drank in a year despite drinking 5 times more than what youre supposed to drink in a day. 1. Please say ill be fine from this ??? Or should i get help???2. Why is it only diabetes is mentioned with this much tiredness and thirst but apparently my sugars arent high enough. Is there a doctor here that can help? Should i get second opinion? 3. I keep going to the doctors and they mention how ita above normal but they dont do anythimg but the most recent one was avtually apparentlt normal. Sorry for the spelling on movile and my predicted text doesnt work.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diabazole, does it really works?", "tags": ["Exercise", "Diet", "Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I like to know does Diabazole cures Type 2 Diabeties ?I see many things on Facebook for Diabeties but, I feel they just there to make money. I just hope there is something out there that really works and help people.Thank<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diebetic nuerapathy", "tags": ["Insulin", "Living With", "Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 4, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Hi I've been living with type 2 diebetes since 2007 I'm 39 years old and have been diagnosed with pherephel nuerapathy in 2014 mainly due to my blood sugar being out of control. Six months ago my primary care Dr moved away so I was assigned a new doctor . My original Dr never done an EMG on me so my new Dr sent me to the neurologist so she could know for sure what's wrong with me. Since 2014 I've been dealing with every pain associated with nuerapathy its gotten worse to the point wear both of my feet are nearly 100% numb on the bottom soles and my toes are going completely numb as well. I'm having a hard time walking ,losing balance, body weakness, arms going numb, and elecrtic shocks in hands and arms,etc.. I've been on amatripiline, venaflaxine, gabepaten, lyrica, and cymbalta. Nothing has worked for me. I know there's no cure. I haven't been able to work in two Years. So I get my nerve test results back and my doctor tells me I can work any job that I want only restrictions is no lifting heavy machinery. Here's my test results I would like to know what my prognosis is for my future will my condition worse? What kind of work can I do? And what is my condition? My doctor wasnt very helpful at all. TEST RESULTS.Your nerve test dose show diabetic neuropathy.Your upper extremities testing was normal no carpal tunnel.How is your pain?Let me know if you have any questionsJulia Pierce,MDConclusion: 1. Study is consistent with a moderate severity fiber-length dependent (distal) sensorimotor polyneuropathy with axonopathic features.2. Needle EMG survey of the LEFT leg is normal.3. Comparison study of the LEFT UE was done and no electrical findings for a median neuropathy/carpal tunnel or focal ulnar neuropathy are present at this time.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Do you take notes at doctor appointments?", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Have you ever considered recording your doctor appointments so that you can re-visit what your doctor said at a later time? Do you take notes while your doctor is talking? What system do you have in place to make sure that you absorb and remember what is said during your appointment?This article from the New York Times sparked this train of thought in case you want to take a look: <BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diabetic, unusual symptoms", "tags": ["Type 2 Diabetes", "Symptoms"], "Type1": false, "Type2": true, "numberOfReplies": 3, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I'm diabetic yesterday my blood sugar was 164 today it's 111. I've been having an overwhelming feeling of sleepiness like I've been drugged. This has been going on for over two weeks. Can anyone tell me what this may be from?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Foot pain", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    How can I tell the difference e between plantar fasciitis and possible diabetic nerve pain<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Fainting", "tags": ["Exercise", "Diet", "Type 2 Diabetes", "Symptoms"], "Type1": false, "Type2": true, "numberOfReplies": 3, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I am a 72 year old mail who cycling 2500 to 3000 miles a year, at 5/10 I weight 190. I have had type 2 diabetics for 20 years, my a1c is 7.5 down from 8.2 over the winter. The other day after traveling across the us I Rested over night and did som driving and rode 20 miles on my bike ( that is a normal ride for me). I did not eat any carbs that day, had yogurt, soup and a Salid with cheese. Just before dinner I felt light headed, I got up and fainted. After eating some sugar and sweating a lot, I rested and felt better after an hour. I think it was very low BS that caused me to faint. Is that reasonable? Thank you<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Help getting on track", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I am 29 years old and have been a diabetic since 2007 after the birth of my first child. I am in need of some guidance on getting my diabetes under control. I've committed to cutting back on eating habits and even starting to exercise. My problem is I work overnight at a Fast Food restaurant and I'm not on a steady eating plan, so I don't take my medication regularly or have a good sleep pattern. What is something I can do to fix this? Any suggestions?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Loss of Taste", "tags": ["Oral Care", "Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    August 27th I had the most stressful day of my life, driving from Glen Rose, Texas to Branson, Missouri in our RV. I accidentally gave myself hyperglycemia that day and did not know it. I got very sick, thinking that I had caught the flu. I was not shooting my insulin, normally 50 units in the morning and 50 at night, because I wasn't eating. When I did eat, absolutely nothing tasted good. This went on for thirteen days until I finally decided to look online for high blood sugar symptoms. I had 12 of the 12 listed. I finally checked my glucose level, it was 465.I made appointment the betty next morning with my VA doctor.Because my A1C was 11.4 he refused to discuss any of my problems and blamed everything on my sugars.It has been 2 weeks now. I have been doing all of my insulin injections religiously. My glucose readings are where they should be, but everything still tastes extremely bad.Does anyone have suggestions on cause or cure?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Diabetic Dawn Syndrome Help", "tags": ["Insulin", "Treatments", "Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 3, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I have been a diabetic since 1991. As the disease has progressed from pills to injections, I have been unable to get a handle on diabetic \"Dawn Syndrome\". I have read and followed every article suggestion and book reviews on the subject but my sugar count was consistently over 200 when rising in the morning. At bedtime around 10:30PM, my sugar would be between 110 and 125. My last food intake was between 7:00 and 7:30 PM.Then I make a mixture of Gin (Beefeater) and yellow raisins. I took an empty sauce jar and filled it half-way with the yellow raisins. I covered the raisins with Gin and left a 2 inch surplus of Gin on the top of the raisins. I closed the jar and let it marinate for 7 days on my kitchen counter. After most of the Gin was absorbed by the raisins, I placed the covered jar in the refrigerator. (This process is usually recommended for people with Arthritis).After I took my diabetic medicine at bedtime, I also took nine (9) raisins. When I woke, my sugar reading were normal between 103 and 128. The phenomenon that has occurred still remains. I do not know why but the results obtained through this method continue. I also take the raisins before each meal and I have reduced my Insulin injection amount by 50 %. This is an inexpensive solution with no side effects..........<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Hyperglycemia", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 6, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    My BSL level goes upto 250 after dinner in the night( PP) This was detected when CGM machine showed higher sugar in the night but in the morning it showed within the range of 100 to 110. I have been following strict diet , particularly in the night. My PP level in the afternoon are around 150.  I take glycomet GP 0.5 ( mor/eve ) & aurvedic medicine in the afternoon & evening. My recent HB A 1 C is 7 I am diabetic type 2 for the last 15 yearskindly advise me<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Brittle nails, diagnosed prediabetic in the past...concerned", "tags": ["Type 2 Diabetes", "Symptoms"], "Type1": false, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Hi, I was diagnosed prediabetic in the past and I live a pretty sedentary lifestyle. I have other underlying health issues such as mental issues which requires antipsychotics, antidepressants and anticonvulsants. Every time I drink a soda, I feel quite nauseous as if I want to vomit and fatigued. I do not feel like I have the energy in me that people would get from caeffinated drinks and alongside, I have brittle nails now. They break or split pretty easily. I also suffer from blurred vision on some days and some days it's clear. I take Women's Raw multivitamin, Biotin for hair growth, Co Q10 for migraines, Magnesium Glycinate/Taurate and Malate. Didn't know if maybe the Women's Raw multivitamin is causing this? I sure hope not! I'm also overweight or on the verge to obesity I believe with a BMI of 29ish to 30ish. I take Depakote, Saphris, and Prozac which I believe makes it worse for me. Not sure what options I have? Mental health matters to me. I just hate feeling of wanting to vomit and any suggestions of whom I should see or be referred to?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Need info on diabetes", "tags": ["Type 1 Diabetes"], "Type1": true, "Type2": false, "numberOfReplies": 6, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Is it possible to go into diabetic coma while asleep, vomit, and aspirate?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "From Pre diabetic to sudden onset  low glucose number", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I have been in the pre diabetic range for over 10 years with my A1c hovering between 5.8 and 6.2. Have never been on any medication related to pre diabetes.For the last week I have felt periods of light headedness and have noticed by BG readings have changed noticeably.  To give you an example I eat the same breakfast every day for years and one hour later my meter has normally read about 120. Now my meter is reading 77 before bkfast 82 an hour after and 72 two hours after. My pre dinner and after dinner measurement have shown similar significantly lower readings .These changes from my expected normal average readings over the last 16 months started about a week ago when my light headedness started.Am planning a doctors appt to discuss this but am interested on any info on what may be causing this lowering of my BG levels and mild light headednessThanks for any insight as to what may be causing this<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Free Style Lite discount card", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I have been using Free Style Lite strips for 6 years. My prescription states to test twice daily. Using the Abbott Free Style Lite discount card have been receiving 100 strips (2 - 50 qty) for $15.00 copay at Walgreens. But the last 4 refills have been paying $30 for the same order. I’m assuming Walgreens corporate has changed participation in the discount program. Local Walgreens staff haven’t been able to find an answer.Abbott Free Style HELP line is useless unable to get a human response.  Recently I purchased (cash) a Prodigy brand meter ($11.99) and strips ( 50 strips $7.49). Issues I have of not abandoning Free Style (1)Prodigy requires twice the amount of blood. (2) This meter also cancels test if there isn’t enough blood no chance to stick again before timing out like the Free Style.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Fasting 10 hours HbA1c of 5.6 and blood glucose of 102", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    A short time ago I went in to get new glasses and they could not get the focus dialed in so the optometrist took a closer look at my eyes and said I have Diabetic retinopathy. I made an appointment with a very well qualified Ophthalmologist and he confirmed the Diabetic retinopathy. He ordered some blood work and after Fasting 10 hours my HbA1c was 5.6 and my blood glucose was 102. I have been having unusual pains in my feet for some time. I am always thirsty and I have to go about every 4 hours. I don't know if this has anything to do with it but I started sweating excessively about the same time I started having the unusual foot pains. I have an appointment with a new GP tomorrow So I will get his take on this then. (The foot pain can best be described as feeling like electric shocks shooting through my feet). The blood work says I am the high side of normal but everything else suggests I am at least pre-diabetic. Any thoughts on this?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Can Apple Cider Vinegar Lower Blood Sugar?", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 3, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Apple cider vinegar has long been used as a home remedy by many for a number of things, from weight loss to whitening teeth. You may have even heard that it can help lower your blood sugar and control insulin. But can apple cider vinegar really do all that? Find out: <BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "What medications can be mixed and which can't", "tags": ["Diet", "Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 3, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Hi all, I have been diagnosed with type 2 diabetes 3 years ago. Yesterday I've been to the physician who diagnosed me with atherosclerosis and prescribed me new medication. It is one of diabetes' common complications. So now I have already a number of pills to take every day including Fibrates, Ezetimibe, Metformin, etc. I've already got used to take pills regularly however it's a stupor when I get cold or something. As it is very important to know what medications can be mixed and which can't and it could have bad consequences if you mix incompatible ones. What could you advice? Thx.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Excessive Sweating", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 3, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I lave been living in FL for 4 years. For the past 6 months to a year, I have experienced unusually high episodes of sweating. This morning, the new man in my life made a comment about it. I have been past menopause for a good 10 years. Can you help me?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Help", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    My girlfriend is a very brittle diabetic. Her insulin pump isn't helping! I heard a kidney and partial pancreas could save her life!!!! Can I live without them?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Cloudy urine.", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I had some blood test done with my doctor. And they took a sample of my urine. They gave me a print out of everything was done. When I got home I noticed it said my urine was cloudy. My wife said I should of urinated before giving sample.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "I am in a pre-diabetic stage........", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    and looking for a nutritrionist diet that I may use to prevent becoming a diabetic old man.Thanks in advance for any help you may render.Manuel A. Rodriguez<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Addition to my last post", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I just wanted to add to my last post that I don't have any other symptoms that diabetics talk about..tingling, fatigue, etc. My blood pressure is very good and my cholestorol level is excellent. Even when my bs levels were over 200 (when I wasn't watching my diet) I never had any other symptoms.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Help Reversing Diabetic Peripheral Neuropathy", "tags": ["Treatments", "Diet", "Living With", "Type 2 Diabetes", "Type 1 Diabetes", "Symptoms"], "Type1": true, "Type2": true, "numberOfReplies": 6, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Hello, I was hoping someone out there could be of assistance. I have been working hard on helping my father improve his numbers as a diabetic. I have most every number, BP, Cholestorol, body weight, etc down to normal. His Resting blood sugar is still a bit elevated in the 120s his post meal BS doesn't typically make it into the 150s. The only symptom still persisting is the DPN. I was wondering if the WebMD community knew of any study than looked at vascular epithelial tissue restoration/deterioration as a function of blood glucose levels. My aim is to understand if there are any windows or Thresholds of blood glucose levels that if we can stay within or under, restoration will most likely commence. Thank you so very much!<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "simple ways to lower high blood sugar fast", "tags": ["Exercise", "Treatments", "Diet"], "Type1": true, "Type2": true, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    there is a lot of people in the world that suffering from the high blood sugar and in the following i will tell you how to lower blood sugar fast1-Exercise daily in certain timesExercise is a good way to get better blood sugar control and keep your blood sugar levels in a healthy range as a part of your routine diabetes management.2-Eat a protein-packed snackProtein acts as a blood sugar stabilizer can slow the absorption rate of glucose.3-AvocadosPolyunsaturated fatty acids (PUFAs) and monounsaturated fatty acids (MUFAs) are important components of a healthy blood sugar eating plan.4-GarlicGarlic has such a great power to help manage blood sugar. Reports show garlic intake can lower fasting blood glucose, which is your blood sugar level when you haven’t eaten.source : <BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "How do you manage your diabetes at work?", "tags": ["Living With", "Type 1 Diabetes"], "Type1": true, "Type2": false, "numberOfReplies": 0, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    It isn’t always easy to get through the workday when you have type 1 diabetes. From bringing your boss on board to being prepared for emergencies to knowing your triggers, here are some tips to make your 9 to 5 easier:  What tips have you learned for managing your diabetes at the office?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "what should i do suger level is 214 and prego", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    my girlfriend is pregos and diabetic she just ate about an hr ago and she just check her level and it is 214 im pritty sure that is high what should she do to bring it down ..she is have alil piuan in her stomech and she doesnt seem to be in any pian or feeling sick in any way but i do know that her level shouldnt be that high what should she do to bring it down<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "High blood sugar", "tags": ["Treatments", "Type 1 Diabetes"], "Type1": true, "Type2": false, "numberOfReplies": 3, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    My morning blood sugar is running 444-573 the past 4 days. I'm using an insulin pump. Taking 10 units every 2 hours. Total insulin per day is over 10 times my normal dose. Not having luck getting my sugars down. Any suggestions?<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Topical chicken soup to treat type 1 diabetes? The immunological basis explained ...", "tags": ["Treatments", "Type 1 Diabetes"], "Type1": true, "Type2": false, "numberOfReplies": 3, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Technical version:Topical chicken protein to treat type 1 diabetes? The immunological basis explained ...  Simplified version:Strange idea? May not be for people familiar with food allergy treatment.Peanut protein patch applied to HEALTHY skin is a treatment for peanut allergy.One of the ways peanut protein applied to skin works, is the generation of regulatory T cells (Tregs) specific to peanut.Tregs regulate/moderate the immune system's reaction to peanut exposure.One of the causes for type 1 diabetes (T1D) is a reduction in the number of Tregs in the pancreas. This allows CD8+ T cells to attack the islet cells, unrestrained, causing T1D. Why chicken soup?As explained in the articles below, chicken protein is the most likely source of the proteins that train the CD8+ T cells to attack the islet cells. We need chicken protein specific Tregs to restrain them.     The potential solution is to create chicken protein specific Tregs by topical chicken soup. Why topical and not drinking/eating chicken soup?Tregs are trained to home to a part of the body.Eating/drinking chicken soup generates Tregs that home to the gut.Topical chicken soup generates Tregs that home to the skin.As described in the articles above, the CD8+ T cells that attack islet cells are trained to home to the skin. But it turns out the pancreas attract these cells by producing the same chemical attractant as the skin.Therefore skin homing Tregs produced by topical chicken soup will also home to the pancreas just like the CD8+ T cells. Going by the peanut patch experience, it could take up to a year to see the effect ... if it works.IMPORTANT: Never apply food proteins to damaged skin, only to HEALTHY skin.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Started weight training - seem much more insulin sensitive?", "tags": ["Exercise", "Insulin", "Type 1 Diabetes"], "Type1": true, "Type2": false, "numberOfReplies": 2, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Hey,For most of my teenage/young adult life I haven't ever worked out. My life was never athletic and I sat at a computer most of the day.Recently (just starting college) I'll attend the gym 3-4 times a week and do standard weight training (focus a different body part each day) with nothing super intensive. I'm pretty much primarily focusing on upper body.It seems, however, right after I come home I'm crazy insulin sensitive. There will be periods where I'll give half the recommended amount of insulin and I'll still drop from 300 to 60 (if my blood sugar for some reason got high right afterwards).I feel very tired right afterwards (like a physical tired, not necessarily sleepy) and I get very anxious.The few days after I go to the gym I'll still feel this effect where insulin is much more sensitive.I'm getting a little annoyed/scared because I'll sometimes take my blood sugar at 9:00 PM (after going to the gym around 3:00 PM) and I'll be 250, I give a shot, then it'll drop really quickly/too much and I have to have snacks periodically to get it go to back up.Is this common? I know that working out will obviously make you drop directly afterwards but are there ever cases where it will make you THIS insulin sensitive?I've only been working out for maybe ~2 months.My diet is really sparse recently which I feel may be a leading factor in this. I'll wake up, grab a granola bar or something, then wait until later in the day to eat a full meal.Please let me know if you need any other information!Best wishes,Samuel<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "My blood sugar spiked...how do I get it down quickly?", "tags": ["Type 2 Diabetes"], "Type1": false, "Type2": true, "numberOfReplies": 3, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I'm new to this and just want to understand the best things to do when my blood sugar spikes. I've read a lot but want to hear from others who have actually been managing this for some time. My spikes are below 300 (which is the number I've heard you should call your doctor at) but are still concerning to me. They are in the 200-240 range in case that's important. Any help would be appreciated! I want to learn how to control this with as little medication as possible, but I know that isn't always an option.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "Type 3c Diabetes Mellitus", "tags": ["Insulin", "Treatments"], "Type1": true, "Type2": true, "numberOfReplies": 4, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    I read a comment about a patient with Type3c Diabetes on WebMD and I would like more information for my husband.He was diagnosed with pancreatic cancer in 2014. He underwent the \"Whipple\" surgical procedure, has been on several chemotherapies (Gemzar, Folfirinox, comb. of Gemzar and Abraxane). He had a second surgery when the cancer metastasized to his liver and a tumor was removed in 2016. In January of this year he was put on Opdivo Immunotherapy because his tumor revealed he had the PD-1 Protein. Two weeks ago he was diagnosed with Diabetes - which type is unknown. Well, at least we can't find any answers from local providers. I came across the term Type 3cDM when doing research online. There are several discussions about people who develop it because of pancreatic surgery or recurrent pancreatitis. I don't want the fact that we live in a rural location to stop him from receiving the correct treatment. He doesn't need to lose weight, we are fighting hard to keep weight on him! He takes enzymes (Creon) with each meal. We are trying to count carbs and watch any sugar intake. He checks his blood 4 times a day and has two types of insulin - long acting Basaglar taken each morning and Humalog when his blood glucose is above 150.I would like additional information about how this type of diabetes should be treated, what concerns should we keep in mind to keep him safe? Some comments stated a type 3cDM should not take insulin. I need to do the right thing and treat this correctly.<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"},
{"title": "About the vagina", "tags": [], "Type1": true, "Type2": true, "numberOfReplies": 1, "threadBody": "<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;    Does diabetes affect the vagina<BR>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"}
]