{
	'title': ['Meal Replacements for Type II'],
	'tags': ['Type 2 Diabetes'],
	'numberOfReplies': 4,
	'threadBody': ['\r\n\t\t\t    Is it a good idea to use meal replacement shakes for breakfast and lunch if you are type II?', '\r\n\t\t\t']
}, {
	'threadId': ['Meal Replacements for Type II'],
	'replyText': ['\r\n\t\t\t    There are countries in the world that are focused on consuming fresh, whole, non-processed diets (Mediterranean, Japan, Nordic, West Africa, etc). These countries have very low incidence of Obesity, cardiovascular disease and Type 2 Diabetes. ', ' ', 'Do you think that\'s by "coincidence"? Do you think these peoples are just dumb "lucky"? ', ' ', ' ', ' ', "Americans want convenience. We want food that's fast. We want food that's tasty. We want food that's cheap. And, we don't want food that requires a lot of work. ", ' ', 'I think "Meal Replacement Shakes" fits, E X A C T L Y , what a typical American wants to eat/drink. (Note: my other favorite term for faux food is "Energy Bar"). ', ' ', 'Do you think it\'s "bad luck" that Obesity and Type 2 Diabetes are skyrocketing in the US? I don\'t think luck has anything to do with it. ', "When it comes to food, drink and drugs, Americans are the most gullible people on the planet. Luck ain't got nuttin to do with it; We are, exactly, what we eat.", '\r\n\t\t\t']
}, {
	'title': ['Diabetes'],
	'tags': ['Symptoms'],
	'numberOfReplies': 4,
	'threadBody': ["\r\n\t\t\t    Here recently I've had an increase of urination...Especially at night. I seem to be thirsty more and have dry mouth especially at night and when I wake up. I'm tired more often even though I get 8 plus hours of sleep at night. Also, I'm hungry all the time and sometimes not long after I eat.", '\r\n\t\t\t']
}, {
	'threadId': ['Meal Replacements for Type II'],
	'replyText': ["\r\n                I don't mean to be crude or insensitive. But, I've been caring for my mother for the last 8 1/2 years, now. Before, I took on the responsibility for her care, she was prescribed medication for the following conditions (which is hardly unusual for someone 87 years old, btw...): ", ' ', 'moderate high blood pressure ', 'mild osteoporosis ', 'frozen shoulder (fibromyalgia) ', 'rheumatoid arthritis ', ' ', 'She stopped her daily 1 mile walk, 1 1/2 years ago, for safety reasons. She, now walks every other day, though. ', ' ', '...And, today, she no longer takes any prescription medications, vitamins or supplements of any kind... ', ' ', ' ', 'My point is this, from my own personal experience (I reversed my Type 2 Diabetes, 12 years ago) and, now, caring for my 95 year old mother, ', 'I simply cannot emphasize just how important diet is to maintaining a strong and healthy immune system, vital in preventing diseases ', 'caused by chronic, long term inflammation. ', ' ', 'I know why you want to drink that "stuff". All I can tell you is what has become crystal clear to me this last decade of my life (62). If you\'re goal is to get better, no matter what condition you have, you have to improve your health. And, in order to do this, you have to get deadly serious about the things you put in that piehole of yours! ', ' ', 'It\'s bloody simple, actually. Is your diabetes getting better, or, is it getting worse. That\'s the true acid test. If you\'re truly eating healthy, your diabetes meds should be decreasing. And, if your meds are "progressing", you still haven\'t learned a damn thing about what foods to eat when you have an inflammatory lifestyle disease! ', ' ', 'Like I said, there are many areas of the world that maintain a healthy ', "diet throughout their lifetimes. And, they are not fat. And, they don't have high blood pressure. And, they don't develop Type 2 Diabetes. ", ' ', 'I can assure you, none of these people open a "can", every morning, for breakfast, either.', '\r\n\t\t\t']
}, {
	'threadId': ['Diabetes'],
	'replyText': ["\r\n\t\t\t    These are all classic symptoms of Type 2 Diabetes. So, what's your question? ", ' ', 'In any event, this is how diabetes is "diagnosed"... ', ' ', 'https://www.webmd.com/diabetes/guide/diagnosis-diabetes#1', '\r\n\t\t\t']
}, {
	'threadId': ['Diabetes'],
	'replyText': ['\r\n\t\t\t    My glucose level was 100.', '\r\n\t\t\t']
}, {
	'title': ['Foot Ulcer'],
	'tags': ['Type 2 Diabetes'],
	'numberOfReplies': 2,
	'threadBody': ["\r\n\t\t\t    I have had a foot ulcer for about 3 months now. The foot doctor keeps cutting it away but it doesn't seem to be healing. Any suggestions?", '\r\n\t\t\t']
}, {
	'threadId': ['Meal Replacements for Type II'],
	'replyText': ["\r\n                That was really well put Bruno. The bottom line is that whole, fresh, unprocessed food in moderate quantities is always best. Those 'meal replacement shakes' are only palatable because of all the sugar in them. Fine, they contain (in theory) the nutrients they claim to, but you can eat an apple on the run. So much better for you. And more fiber.", '\r\n\t\t\t']
}, {
	'threadId': ['Diabetes'],
	'replyText': ['\r\n                Glucose levels are not definitive for diagnosing Diabetes. Family history, age, race, lifestyle, all, have to be investigated. ', ' ', 'You can be diagnosed with prediabetes or Type 2 Diabetes but not show abnormal blood sugar levels, did you know that? "Metabolic Syndrome" is a condition that you should come to understand. It is also known as "prediabetes". There are 5 factors to be considered: Obesity, High blood pressure, High blood sugar, High triglycerides & Low HDL Cholesterol. If you have ANY three of the 5 factors, you are considered "prediabetic". ANY 3 (it doesn\'t need to be high blood sugar!). ', ' ', 'This is why diabetes is so closely associated with advancing age. Its closely tied to natural changes in hormone levels associated with older people. But, you can mess with the natural aging process, ie., you can accelerate aging, when you stop performing healthy habits. Like eating real food. Or, exercising. Or, balancing work with family. Or, getting reasonable sleep, every night. ', ' ', 'The greatest health threat that doctors see in their patients, today? "Common sense". People think they can get away with any lifestyle, imaginable. And, the human body will eventually "tire" after years of reckless, thoughtless treatment. ', ' ', "People think that Type 2 Diabetes causes poor health. Wrong. It's poor health that causes T2 diabetes. If you get serious about improving your health, sugar levels, blood pressure, triglycerides and belly fat will fall. That's the greatest misconception I see on this board. ", ' ', 'You don\'t "treat" lifestyle diseases, most especially, T2D... ', 'You "treat" your body and your body will go back to performing a proper job. If you\'re overweight, lose the weight!', '\r\n\t\t\t']
}, {
	'threadId': ['Foot Ulcer'],
	'replyText': ['\r\n\t\t\t    you asked for suggestions... ', ' ', 'Diabetes prevents wound healing, big time. It\'s the number one cause of limb loss in the US. Your doctor is doing what he can but it would be unprofessional for him to say, "Listen to me, Hillbillymom1! Do you know what "gangrene" is? Do you know what happens when a wound won\'t heal and a bacterial infection is allowed to spread? I\'m telling you, it\'s a smell you\'ll never forget! You\'ve must get your diabetes under control, immediately! Only then will your body have a chance of healing that wound. You\'ve got to eat fresh vegetables and fruits, get plenty of rest, drink tons of water and stop any sugar from passing your lips until that ulcer is gone! It\'s now or never, HillBillyMom1! If you like that foot, if you like the way it looks on your leg, then, Please! Listen to me and do as I say!" ', ' ', "You see, your doctor can't say this because he likes his practice and he doesn't want to lose it because of an ethics complaint to the state board... ", ' ', 'But, I aint your doctor. ', ' ', "Get mad! Fight! There's nothing your doctor can do, now. He can't fight for you. Ride your bike, lose a few pounds, feel better, asap.", '\r\n\t\t\t']
}, {
	'threadId': ['Meal Replacements for Type II'],
	'replyText': ['\r\n                Thank you, Cora. ', ' ', 'Here are some quotes and proverbs about the importance of diet... ', '"Just because you\'re not sick doesn\'t mean you\'re healthy" ', ' ', '"Early to bed and early to rise, makes a man healthy wealthy and wise" ~Benjamin Franklin ', ' ', '"Let food be thy medicine and medicine be thy food" ~Hippocrates ', ' ', '"If you can\'t pronounce it, don\'t eat it" ', ' ', '"Time And health are two precious assets that we don\'t recognize and appreciate until they have been depleted." ~Denis Waitley ', ' ', '"Mainstream medicine would be way different if they focused on prevention even half as much as they focused on intervention..." ~Anonymous ', ' ', '"The best and most efficient pharmacy is within your own system." ~Robert C. Peale ', ' ', '"The doctor of the future will no longer treat the human frame with drugs, but rather will cure and prevent disease with nutrition." ~Thomas Edison ', ' ', '"An apple a day keeps the doctor away" ~Proverb ', ' ', '"True healthcare reform starts in your kitchen, not in Washington" ~Anonymous ', ' ', '"The only way to keep your health is to eat what you don\'t want, drink what you don\'t like, and do what you\'d rather not." ~Mark Twain ', ' ', '"A man too busy to take care of his health is like a mechanic too busy to take care of his tools." ~Spanish Proverb ', ' ', '"He who takes medicine and neglects to diet wastes the skill of his doctors." ~Chinese Proverb ', ' ', '"Today, more than 95% of all chronic disease is caused by food choice, toxic food ingredients, nutritional deficiencies and lack of physical exercise." ~Mike Adams ', ' ', '"The part can never be well unless the whole is well." ~Plato ', ' ', '"By cleansing your body on a regular basis and eliminating as many toxins as possible from your environment, your body can begin to heal itself, prevent disease, and become stronger and more resilient than you ever dreamed possible!" ~Dr. Edward Group III ', ' ', 'If diet is wrong, medicine is of no use. If diet is correct, medicine is of no need. Ancient Ayurvedic proverb ', ' ', '"It is easier to change a man\'s religion than to change his diet." — Margaret Mead ', ' ', '"Most people work hard and spend their health trying to achieve wealth. Then they retire and spend their wealth trying to get back their health." -Kevin Gianni ', ' ', '"The healthy person has many wishes, but the sick person has only one." -Indian Proverb ', ' ', '"Nobody likes change but a wet baby!" ', ' ', ' ', 'Diabetes is a very complex and, at times, perplexing condition, I know. But, my advice to anyone who has this disease and is willing to listen, the path to conquering Type 2 Diabetes is, first, between your ears, and, second, inside your kitchen! ', ' ', "When it comes to the food you eat, you can trust nobody's hands except for the one's at the ends of your arms. And, if you eat fresh, whole and green, everyday, your body will have the weapons it needs to to win the war, guaranteed.", '\r\n\t\t\t']
}, {
	'threadId': ['Diabetes'],
	'replyText': ['\r\n\t\t\t    This is a sign of Diabetics. I say 80% chance this is diabetics.', '\r\n\t\t\t']
}